{
  "format": "graph-model",
  "generatedBy": "<https://github.com/ybkscht/EfficientPose>",
  "convertedBy": "<https://github.com/vladmandic>",
  "signature":
  {
      "inputs": {
        "input_1_0": { "name": "input_1_0", "dtype": "DT_FLOAT", "tensorShape":{"dim":[{"size":"1"},{"size":"368"},{"size":"368"},{"size":"3"}]} }
      },
      "outputs":
      {
        "upscaled_confs/BiasAdd:0": { "name": "upscaled_confs/BiasAdd:0", "dtype": "DT_FLOAT", "tensorShape":{"dim":[{"size":"1"},{"size":"-1"},{"size":"-1"},{"size":"16"}]} }
      }
  },
  "modelTopology":
  {
      "node":
      [
          {"name":"upscaled_confs/strided_slice/stack","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"upscaled_confs/strided_slice/stack_1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"upscaled_confs/strided_slice/stack_2","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"upscaled_confs/strided_slice_1/stack","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"upscaled_confs/strided_slice_1/stack_1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"upscaled_confs/strided_slice_1/stack_2","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"upscaled_confs/mul/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"upscaled_confs/strided_slice_2/stack","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"upscaled_confs/strided_slice_2/stack_1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"upscaled_confs/strided_slice_2/stack_2","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"upscaled_confs/mul_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"upscaled_confs/stack/3","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"upscaled_confs/kernel","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"4"},{"size":"4"},{"size":"16"},{"size":"16"}]}}}}},
          {"name":"upscaled_deconv2/strided_slice/stack","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"upscaled_deconv2/strided_slice/stack_1","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"upscaled_deconv2/strided_slice/stack_2","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"upscaled_deconv2/strided_slice_1/stack","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"upscaled_deconv2/strided_slice_1/stack_1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"upscaled_deconv2/strided_slice_1/stack_2","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"upscaled_deconv2/mul/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"upscaled_deconv2/strided_slice_2/stack","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"upscaled_deconv2/strided_slice_2/stack_1","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"upscaled_deconv2/strided_slice_2/stack_2","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"upscaled_deconv2/mul_1/y","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"upscaled_deconv2/stack/3","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"upscaled_deconv2/kernel","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"4"},{"size":"4"},{"size":"16"},{"size":"16"}]}}}}},
          {"name":"upscaled_deconv1/strided_slice/stack","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"upscaled_deconv1/strided_slice/stack_1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"upscaled_deconv1/strided_slice/stack_2","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"upscaled_deconv1/strided_slice_1/stack","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"upscaled_deconv1/strided_slice_1/stack_1","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"upscaled_deconv1/strided_slice_1/stack_2","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"upscaled_deconv1/mul/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"upscaled_deconv1/strided_slice_2/stack","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"upscaled_deconv1/strided_slice_2/stack_1","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"upscaled_deconv1/strided_slice_2/stack_2","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"upscaled_deconv1/mul_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"upscaled_deconv1/stack/3","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"upscaled_deconv1/kernel","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"4"},{"size":"4"},{"size":"16"},{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass3_block2_mbconv2_detection2_dense/concat/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"pass3_block2_mbconv3_detection2_dense/concat/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"pass2_block2_mbconv2_detection1_dense/concat/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"pass2_block2_mbconv3_detection1_dense/concat/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"pass1_block2_mbconv2_skeleton_dense/concat/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"pass1_block2_mbconv3_skeleton_dense/concat/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"pass1_block1_mbconv2_skeleton_dense/concat/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"pass1_block1_mbconv3_skeleton_dense/concat/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"concatenate_1/concat/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"pass2_block1_mbconv2_detection1_dense/concat/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"pass2_block1_mbconv3_detection1_dense/concat/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"input_1_0","op":"Placeholder","attr":{"dtype":{"type":"DT_FLOAT"},"shape":{"shape":{"dim":[{"size":"1"},{"size":"368"},{"size":"368"},{"size":"3"}]}}}},
          {"name":"concatenate_2/concat/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"pass3_block1_mbconv2_detection2_dense/concat/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"pass3_block1_mbconv3_detection2_dense/concat/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"pass3_detection2_confs/kernel","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"168"},{"size":"16"}]}}}}},
          {"name":"pass3_detection2_confs/bias","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}}}},
          {"name":"efficientnet-lite4/model/stem/conv2d/Conv2D_0/convolution_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"3"},{"size":"32"}]}}}}},
          {"name":"pass3_block1_mbconv3_detection2_dconv1/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"336"},{"size":"1"}]}}}}},
          {"name":"efficientnet-lite4/model/stem/conv2d/Conv2D_0/convolution_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}}}},
          {"name":"efficientnet-lite4/model/blocks_0/depthwise_conv2d/depthwise_0/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/blocks_0/depthwise_conv2d/depthwise_0/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}}}},
          {"name":"efficientnet-lite4/model/blocks_0/conv2d/Conv2D_0/convolution_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"24"}]}}}}},
          {"name":"pass3_block1_mbconv3_detection2_dconv1/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}}}},
          {"name":"efficientnet-lite4/model/blocks_0/conv2d/Conv2D_0/convolution_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/blocks_1/conv2d/Conv2D_0/convolution_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"144"}]}}}}},
          {"name":"efficientnet-lite4/model/blocks_1/conv2d/Conv2D_0/convolution_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"144"}]}}}}},
          {"name":"efficientnet-lite4/model/blocks_1/depthwise_conv2d/depthwise_0/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"144"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/blocks_1/depthwise_conv2d/depthwise_0/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"144"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/blocks_1/conv2d_1/Conv2D_0/convolution_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"144"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass3_block1_mbconv3_detection2_conv2/convolution_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"336"},{"size":"56"}]}}}}},
          {"name":"efficientnet-lite4/model/blocks_1/conv2d_1/Conv2D_0/convolution_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/blocks_2/conv2d/Conv2D_0/convolution_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"192"}]}}}}},
          {"name":"efficientnet-lite4/model/blocks_2/conv2d/Conv2D_0/convolution_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"pass3_block1_mbconv3_detection2_conv2/convolution_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"56"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/blocks_2/depthwise_conv2d/depthwise_0/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"192"},{"size":"1"}]}}}}},
          {"name":"efficientnet-lite4/model/blocks_2/depthwise_conv2d/depthwise_0/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/blocks_2/conv2d_1/Conv2D_0/convolution_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/blocks_2/conv2d_1/Conv2D_0/convolution_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/blocks_3/conv2d/Conv2D_0/convolution_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/blocks_3/conv2d/Conv2D_0/convolution_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass3_block2_mbconv1_detection2_conv1/convolution_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"168"},{"size":"336"}]}}}}},
          {"name":"efficientnet-lite4/model/blocks_3/depthwise_conv2d/depthwise_0/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/blocks_3/depthwise_conv2d/depthwise_0/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"efficientnet-lite4/model/blocks_3/conv2d_1/Conv2D_0/convolution_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/blocks_3/conv2d_1/Conv2D_0/convolution_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}}}},
          {"name":"efficientnet-lite4/model/blocks_4/conv2d/Conv2D_0/convolution_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"192"}]}}}}},
          {"name":"pass3_block2_mbconv1_detection2_conv1/convolution_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/blocks_4/conv2d/Conv2D_0/convolution_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"efficientnet-lite4/model/blocks_4/depthwise_conv2d/depthwise_0/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"192"},{"size":"1"}]}}}}},
          {"name":"efficientnet-lite4/model/blocks_4/depthwise_conv2d/depthwise_0/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/blocks_4/conv2d_1/Conv2D_0/convolution_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/blocks_4/conv2d_1/Conv2D_0/convolution_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/blocks_5/conv2d/Conv2D_0/convolution_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass3_block2_mbconv1_detection2_dconv1/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"336"},{"size":"1"}]}}}}},
          {"name":"efficientnet-lite4/model/blocks_5/conv2d/Conv2D_0/convolution_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/blocks_5/depthwise_conv2d/depthwise_0/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"192"},{"size":"1"}]}}}}},
          {"name":"efficientnet-lite4/model/blocks_5/depthwise_conv2d/depthwise_0/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"efficientnet-lite4/model/blocks_5/conv2d_1/Conv2D_0/convolution_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"56"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass3_block2_mbconv1_detection2_dconv1/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/blocks_5/conv2d_1/Conv2D_0/convolution_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"56"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/blocks_6/conv2d/Conv2D_0/convolution_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"56"},{"size":"336"}]}}}}},
          {"name":"efficientnet-lite4/model/blocks_6/conv2d/Conv2D_0/convolution_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/blocks_6/depthwise_conv2d/depthwise_0/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"336"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/blocks_6/depthwise_conv2d/depthwise_0/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}}}},
          {"name":"efficientnet-lite4/model/blocks_6/conv2d_1/Conv2D_0/convolution_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"336"},{"size":"56"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass3_block2_mbconv1_detection2_conv2/convolution_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"336"},{"size":"56"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/blocks_6/conv2d_1/Conv2D_0/convolution_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"56"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/blocks_7/conv2d/Conv2D_0/convolution_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"56"},{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/blocks_7/conv2d/Conv2D_0/convolution_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}}}},
          {"name":"pass3_block2_mbconv1_detection2_conv2/convolution_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"56"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/blocks_7/depthwise_conv2d/depthwise_0/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"336"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/blocks_7/depthwise_conv2d/depthwise_0/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}}}},
          {"name":"efficientnet-lite4/model/blocks_7/conv2d_1/Conv2D_0/convolution_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"336"},{"size":"56"}]}}}}},
          {"name":"efficientnet-lite4/model/blocks_7/conv2d_1/Conv2D_0/convolution_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"56"}]}}}}},
          {"name":"efficientnet-lite4/model/blocks_8/conv2d/Conv2D_0/convolution_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"56"},{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass3_block2_mbconv2_detection2_conv1/convolution_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"56"},{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/blocks_8/conv2d/Conv2D_0/convolution_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/blocks_8/depthwise_conv2d/depthwise_0/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"336"},{"size":"1"}]}}}}},
          {"name":"efficientnet-lite4/model/blocks_8/depthwise_conv2d/depthwise_0/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}}}},
          {"name":"efficientnet-lite4/model/blocks_8/conv2d_1/Conv2D_0/convolution_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"336"},{"size":"56"}]}}}}},
          {"name":"pass3_block2_mbconv2_detection2_conv1/convolution_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/blocks_8/conv2d_1/Conv2D_0/convolution_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"56"}]}}}}},
          {"name":"pass1_block1_mbconv1_skeleton_conv1/convolution_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"56"},{"size":"336"}]}}}}},
          {"name":"pass1_block1_mbconv1_skeleton_conv1/convolution_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}}}},
          {"name":"pass1_block1_mbconv1_skeleton_dconv1/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"336"},{"size":"1"}]}}}}},
          {"name":"pass1_block1_mbconv1_skeleton_dconv1/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass1_block1_mbconv1_skeleton_conv2/convolution_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"336"},{"size":"56"}]}}}}},
          {"name":"pass3_block2_mbconv2_detection2_dconv1/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"336"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass1_block1_mbconv1_skeleton_conv2/convolution_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"56"}]}}}}},
          {"name":"pass1_block1_mbconv2_skeleton_conv1/convolution_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"56"},{"size":"336"}]}}}}},
          {"name":"pass1_block1_mbconv2_skeleton_conv1/convolution_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass3_block2_mbconv2_detection2_dconv1/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}}}},
          {"name":"pass1_block1_mbconv2_skeleton_dconv1/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"336"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass1_block1_mbconv2_skeleton_dconv1/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}}}},
          {"name":"pass1_block1_mbconv2_skeleton_conv2/convolution_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"336"},{"size":"56"}]}}}}},
          {"name":"pass1_block1_mbconv2_skeleton_conv2/convolution_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"56"}]}}}}},
          {"name":"pass1_block1_mbconv3_skeleton_conv1/convolution_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"112"},{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass1_block1_mbconv3_skeleton_conv1/convolution_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass3_block2_mbconv2_detection2_conv2/convolution_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"336"},{"size":"56"}]}}}}},
          {"name":"pass1_block1_mbconv3_skeleton_dconv1/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"336"},{"size":"1"}]}}}}},
          {"name":"pass1_block1_mbconv3_skeleton_dconv1/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass1_block1_mbconv3_skeleton_conv2/convolution_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"336"},{"size":"56"}]}}}}},
          {"name":"pass1_block1_mbconv3_skeleton_conv2/convolution_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"56"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass1_block2_mbconv1_skeleton_conv1/convolution_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"168"},{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass3_block2_mbconv2_detection2_conv2/convolution_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"56"}]}}}}},
          {"name":"pass1_block2_mbconv1_skeleton_conv1/convolution_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}}}},
          {"name":"pass1_block2_mbconv1_skeleton_dconv1/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"336"},{"size":"1"}]}}}}},
          {"name":"pass1_block2_mbconv1_skeleton_dconv1/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass1_block2_mbconv1_skeleton_conv2/convolution_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"336"},{"size":"56"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass1_block2_mbconv1_skeleton_conv2/convolution_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"56"}]}}}}},
          {"name":"pass1_block2_mbconv2_skeleton_conv1/convolution_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"56"},{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass3_block2_mbconv3_detection2_conv1/convolution_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"112"},{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass1_block2_mbconv2_skeleton_conv1/convolution_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass1_block2_mbconv2_skeleton_dconv1/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"336"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass1_block2_mbconv2_skeleton_dconv1/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass1_block2_mbconv2_skeleton_conv2/convolution_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"336"},{"size":"56"}]}}}}},
          {"name":"pass3_block2_mbconv3_detection2_conv1/convolution_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}}}},
          {"name":"pass1_block2_mbconv2_skeleton_conv2/convolution_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"56"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass1_block2_mbconv3_skeleton_conv1/convolution_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"112"},{"size":"336"}]}}}}},
          {"name":"pass1_block2_mbconv3_skeleton_conv1/convolution_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}}}},
          {"name":"pass1_block2_mbconv3_skeleton_dconv1/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"336"},{"size":"1"}]}}}}},
          {"name":"pass1_block2_mbconv3_skeleton_dconv1/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass1_block2_mbconv3_skeleton_conv2/convolution_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"336"},{"size":"56"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass3_block2_mbconv3_detection2_dconv1/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"336"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass1_block2_mbconv3_skeleton_conv2/convolution_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"56"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass2_block1_mbconv1_detection1_conv1/convolution_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"224"},{"size":"336"}]}}}}},
          {"name":"pass2_block1_mbconv1_detection1_conv1/convolution_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}}}},
          {"name":"pass3_block2_mbconv3_detection2_dconv1/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}}}},
          {"name":"pass2_block1_mbconv1_detection1_dconv1/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"336"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass2_block1_mbconv1_detection1_dconv1/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass2_block1_mbconv1_detection1_conv2/convolution_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"336"},{"size":"56"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass2_block1_mbconv1_detection1_conv2/convolution_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"56"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass2_block1_mbconv2_detection1_conv1/convolution_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"56"},{"size":"336"}]}}}}},
          {"name":"pass2_block1_mbconv2_detection1_conv1/convolution_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass3_block2_mbconv3_detection2_conv2/convolution_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"336"},{"size":"56"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass2_block1_mbconv2_detection1_dconv1/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"336"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass2_block1_mbconv2_detection1_dconv1/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}}}},
          {"name":"pass2_block1_mbconv2_detection1_conv2/convolution_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"336"},{"size":"56"}]}}}}},
          {"name":"pass2_block1_mbconv2_detection1_conv2/convolution_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"56"}]}}}}},
          {"name":"pass2_block1_mbconv3_detection1_conv1/convolution_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"112"},{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass3_block2_mbconv3_detection2_conv2/convolution_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"56"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass2_block1_mbconv3_detection1_conv1/convolution_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}}}},
          {"name":"pass2_block1_mbconv3_detection1_dconv1/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"336"},{"size":"1"}]}}}}},
          {"name":"pass2_block1_mbconv3_detection1_dconv1/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}}}},
          {"name":"pass2_block1_mbconv3_detection1_conv2/convolution_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"336"},{"size":"56"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass2_block1_mbconv3_detection1_conv2/convolution_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"56"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass2_block2_mbconv1_detection1_conv1/convolution_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"168"},{"size":"336"}]}}}}},
          {"name":"pass2_block2_mbconv1_detection1_conv1/convolution_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}}}},
          {"name":"pass2_block2_mbconv1_detection1_dconv1/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"336"},{"size":"1"}]}}}}},
          {"name":"pass2_block2_mbconv1_detection1_dconv1/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}}}},
          {"name":"pass2_block2_mbconv1_detection1_conv2/convolution_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"336"},{"size":"56"}]}}}}},
          {"name":"pass2_block2_mbconv1_detection1_conv2/convolution_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"56"}]}}}}},
          {"name":"pass2_block2_mbconv2_detection1_conv1/convolution_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"56"},{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass2_block2_mbconv2_detection1_conv1/convolution_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass2_block2_mbconv2_detection1_dconv1/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"336"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass2_block2_mbconv2_detection1_dconv1/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}}}},
          {"name":"pass2_block2_mbconv2_detection1_conv2/convolution_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"336"},{"size":"56"}]}}}}},
          {"name":"pass2_block2_mbconv2_detection1_conv2/convolution_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"56"}]}}}}},
          {"name":"pass2_block2_mbconv3_detection1_conv1/convolution_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"112"},{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass2_block2_mbconv3_detection1_conv1/convolution_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}}}},
          {"name":"pass2_block2_mbconv3_detection1_dconv1/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"336"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass2_block2_mbconv3_detection1_dconv1/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass2_block2_mbconv3_detection1_conv2/convolution_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"336"},{"size":"56"}]}}}}},
          {"name":"pass2_block2_mbconv3_detection1_conv2/convolution_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"56"}]}}}}},
          {"name":"pass3_block1_mbconv1_detection2_conv1/convolution_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"224"},{"size":"336"}]}}}}},
          {"name":"pass3_block1_mbconv1_detection2_conv1/convolution_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass3_block1_mbconv1_detection2_dconv1/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"336"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass3_block1_mbconv1_detection2_dconv1/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass3_block1_mbconv1_detection2_conv2/convolution_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"336"},{"size":"56"}]}}}}},
          {"name":"pass3_block1_mbconv1_detection2_conv2/convolution_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"56"}]}}}}},
          {"name":"pass3_block1_mbconv2_detection2_conv1/convolution_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"56"},{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass3_block1_mbconv2_detection2_conv1/convolution_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}}}},
          {"name":"pass3_block1_mbconv2_detection2_dconv1/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"336"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass3_block1_mbconv2_detection2_dconv1/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass3_block1_mbconv2_detection2_conv2/convolution_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"336"},{"size":"56"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass3_block1_mbconv2_detection2_conv2/convolution_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"56"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"pass3_block1_mbconv3_detection2_conv1/convolution_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"112"},{"size":"336"}]}}}}},
          {"name":"pass3_block1_mbconv3_detection2_conv1/convolution_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"efficientnet-lite4/model/stem/Relu6_0/Relu6","op":"_FusedConv2D","input":["input_1_0","efficientnet-lite4/model/stem/conv2d/Conv2D_0/convolution_weights","efficientnet-lite4/model/stem/conv2d/Conv2D_0/convolution_bn_offset"],"device":"/device:CPU:0","attr":{"strides":{"list":{"i":["1","2","2","1"]}},"T":{"type":"DT_FLOAT"},"use_cudnn_on_gpu":{"b":true},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"num_args":{"i":"1"},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"epsilon":{"f":0}}},
          {"name":"efficientnet-lite4/model/blocks_0/depthwise_conv2d/depthwise_0/depthwise","op":"FusedDepthwiseConv2dNative","input":["efficientnet-lite4/model/stem/Relu6_0/Relu6","efficientnet-lite4/model/blocks_0/depthwise_conv2d/depthwise_0/depthwise_weights","efficientnet-lite4/model/blocks_0/depthwise_conv2d/depthwise_0/depthwise_bn_offset"],"attr":{"explicit_paddings":{"list":{}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"T":{"type":"DT_FLOAT"},"padding":{"s":"U0FNRQ=="},"num_args":{"i":"1"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}}}},
