{
  "format": "graph-model",
  "generatedBy": "https://github.com/google/mediapipe",
  "convertedBy": "https://github.com/vladmandic",
  "userDefinedMetadata":
  {
    "signature":
    {
      "inputs":
      {
        "input_1:0":{"name":"input_1:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"256"},{"size":"256"},{"size":"3"}]}}
      },
      "outputs":
      {
        "Identity_1:0":{"name":"Identity_1:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"}]}},
        "Identity:0":{"name":"Identity:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"63"}]}}
      }
    }
  },
  "modelTopology":
  {
      "node":
      [
          {"name":"input_1","op":"Placeholder","attr":{"dtype":{"type":"DT_FLOAT"},"shape":{"shape":{"dim":[{"size":"1"},{"size":"256"},{"size":"256"},{"size":"3"}]}}}},
          {"name":"StatefulPartitionedCall/model/conv2d/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"3"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_40/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_1/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"32"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_1/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_2/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_2/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_3/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_3/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_4/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_4/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_5/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_41/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_5/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_6/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_6/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_7/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_41/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_7/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_8/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_8/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_9/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_9/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_10/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_10/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_11/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_11/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_12/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"128"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_42/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_12/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_13/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"128"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_13/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_14/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"128"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_42/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_14/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_15/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_15/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_16/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"128"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_16/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_17/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_17/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_18/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_18/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_19/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_43/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_19/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_20/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_20/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_21/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_43/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_21/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_22/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_22/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_23/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_23/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_24/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_24/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_25/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_25/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_26/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_44/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_26/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_27/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_27/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_28/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_44/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_28/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_29/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_29/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_30/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_30/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_31/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_31/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_32/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_32/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_33/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_45/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_33/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_34/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_34/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_35/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_45/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_35/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_36/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_36/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_37/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_37/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_38/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_38/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_39/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_39/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_40/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_41/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_42/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_43/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"192"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_44/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"192"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/convld_21_3d/Conv2D/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"2"},{"size":"2"},{"size":"192"},{"size":"63"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/convld_21_3d/BiasAdd/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"63"}]}}}}},
          {"name":"StatefulPartitionedCall/model/ld_21_3d/Reshape/shape","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/conv_handflag/BiasAdd/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_handflag/Conv2D/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"2"},{"size":"2"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/p_re_lu/Neg","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"32"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_1/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"32"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_2/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"32"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_3/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"32"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/channel_padding/Pad/paddings","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_4/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"32"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_5/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"64"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_6/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"64"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_7/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"64"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_8/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"64"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_9/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"64"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/channel_padding_1/Pad/paddings","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_10/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"64"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_11/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"128"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_12/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"128"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_13/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"128"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_14/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"128"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_15/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"128"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_16/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"128"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_17/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"128"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_18/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_19/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"192"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_20/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_21/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_22/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_23/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_24/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_25/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_26/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_27/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_28/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_29/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_30/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_31/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_32/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_33/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_34/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_35/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_36/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_37/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_38/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"192"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_39/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_40/depthwise/ReadVariableOp","op":"Const","input":["^input_1"],"attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/batch_normalization/FusedBatchNormV3","op":"_FusedConv2D","input":["input_1","StatefulPartitionedCall/model/conv2d/Conv2D_weights","StatefulPartitionedCall/model/conv2d/Conv2D_bn_offset","StatefulPartitionedCall/model/p_re_lu/Neg"],"device":"/device:CPU:0","attr":{"num_args":{"i":"2"},"epsilon":{"f":0},"padding":{"s":"U0FNRQ=="},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UHJlbHU="]}},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","2","2","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}}}},
          {"name":"Func/StatefulPartitionedCall/output_control_node/_285","op":"NoOp","input":["^StatefulPartitionedCall/model/conv_handflag/BiasAdd/ReadVariableOp","^StatefulPartitionedCall/model/conv_handflag/Conv2D/ReadVariableOp","^StatefulPartitionedCall/model/convld_21_3d/BiasAdd/ReadVariableOp","^StatefulPartitionedCall/model/convld_21_3d/Conv2D/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_1/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_10/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_11/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_12/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_13/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_14/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_15/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_16/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_17/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_18/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_19/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_2/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_20/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_21/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_22/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_23/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_24/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_25/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_26/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_27/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_28/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_29/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_3/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_30/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_31/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_32/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_33/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_34/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_35/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_36/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_37/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_38/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_39/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_4/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_40/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_41/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_42/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_43/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_44/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_5/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_6/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_7/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_8/depthwise/ReadVariableOp","^StatefulPartitionedCall/model/depthwise_conv2d_9/depthwise/ReadVariableOp"]},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d/depthwise","op":"DepthwiseConv2dNative","input":["StatefulPartitionedCall/model/batch_normalization/FusedBatchNormV3","StatefulPartitionedCall/model/depthwise_conv2d/depthwise/ReadVariableOp"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},
          {"name":"StatefulPartitionedCall/model/batch_normalization_1/FusedBatchNormV3","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/depthwise_conv2d/depthwise","StatefulPartitionedCall/model/conv2d_1/Conv2D_weights","StatefulPartitionedCall/model/conv2d_1/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"num_args":{"i":"1"},"epsilon":{"f":0},"padding":{"s":"VkFMSUQ="},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/add/add","op":"AddV2","input":["StatefulPartitionedCall/model/batch_normalization_1/FusedBatchNormV3","StatefulPartitionedCall/model/batch_normalization/FusedBatchNormV3"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation/Relu","op":"Relu","input":["StatefulPartitionedCall/model/add/add"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_1/depthwise","op":"DepthwiseConv2dNative","input":["StatefulPartitionedCall/model/activation/Relu","StatefulPartitionedCall/model/depthwise_conv2d_1/depthwise/ReadVariableOp"],"attr":{"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/batch_normalization_2/FusedBatchNormV3","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/depthwise_conv2d_1/depthwise","StatefulPartitionedCall/model/conv2d_2/Conv2D_weights","StatefulPartitionedCall/model/conv2d_2/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"epsilon":{"f":0},"padding":{"s":"VkFMSUQ="},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"num_args":{"i":"1"}}},
          {"name":"StatefulPartitionedCall/model/add_1/add","op":"AddV2","input":["StatefulPartitionedCall/model/activation/Relu","StatefulPartitionedCall/model/batch_normalization_2/FusedBatchNormV3"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_1/Relu","op":"Relu","input":["StatefulPartitionedCall/model/add_1/add"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_2/depthwise","op":"DepthwiseConv2dNative","input":["StatefulPartitionedCall/model/activation_1/Relu","StatefulPartitionedCall/model/depthwise_conv2d_2/depthwise/ReadVariableOp"],"attr":{"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/batch_normalization_3/FusedBatchNormV3","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/depthwise_conv2d_2/depthwise","StatefulPartitionedCall/model/conv2d_3/Conv2D_weights","StatefulPartitionedCall/model/conv2d_3/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"num_args":{"i":"1"},"epsilon":{"f":0},"padding":{"s":"VkFMSUQ="},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"StatefulPartitionedCall/model/add_2/add","op":"AddV2","input":["StatefulPartitionedCall/model/activation_1/Relu","StatefulPartitionedCall/model/batch_normalization_3/FusedBatchNormV3"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_2/Relu","op":"Relu","input":["StatefulPartitionedCall/model/add_2/add"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_3/depthwise","op":"DepthwiseConv2dNative","input":["StatefulPartitionedCall/model/activation_2/Relu","StatefulPartitionedCall/model/depthwise_conv2d_3/depthwise/ReadVariableOp"],"attr":{"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/batch_normalization_4/FusedBatchNormV3","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/depthwise_conv2d_3/depthwise","StatefulPartitionedCall/model/conv2d_4/Conv2D_weights","StatefulPartitionedCall/model/conv2d_4/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"num_args":{"i":"1"},"epsilon":{"f":0},"padding":{"s":"VkFMSUQ="},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}}}},
          {"name":"StatefulPartitionedCall/model/add_3/add","op":"AddV2","input":["StatefulPartitionedCall/model/activation_2/Relu","StatefulPartitionedCall/model/batch_normalization_4/FusedBatchNormV3"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_3/Relu","op":"Relu","input":["StatefulPartitionedCall/model/add_3/add"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/max_pooling2d/MaxPool","op":"MaxPool","input":["StatefulPartitionedCall/model/activation_3/Relu"],"attr":{"ksize":{"list":{"i":["1","2","2","1"]}},"padding":{"s":"VkFMSUQ="},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","2","2","1"]}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_4/depthwise","op":"DepthwiseConv2dNative","input":["StatefulPartitionedCall/model/activation_3/Relu","StatefulPartitionedCall/model/depthwise_conv2d_4/depthwise/ReadVariableOp"],"attr":{"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","2","2","1"]}},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/channel_padding/Pad","op":"Pad","input":["StatefulPartitionedCall/model/max_pooling2d/MaxPool","StatefulPartitionedCall/model/channel_padding/Pad/paddings"],"attr":{"T":{"type":"DT_FLOAT"},"Tpaddings":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/batch_normalization_5/FusedBatchNormV3","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/depthwise_conv2d_4/depthwise","StatefulPartitionedCall/model/conv2d_5/Conv2D_weights","StatefulPartitionedCall/model/conv2d_5/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"num_args":{"i":"1"},"epsilon":{"f":0},"padding":{"s":"VkFMSUQ="},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}}}},
          {"name":"StatefulPartitionedCall/model/add_4/add","op":"AddV2","input":["StatefulPartitionedCall/model/batch_normalization_5/FusedBatchNormV3","StatefulPartitionedCall/model/channel_padding/Pad"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_4/Relu","op":"Relu","input":["StatefulPartitionedCall/model/add_4/add"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_5/depthwise","op":"DepthwiseConv2dNative","input":["StatefulPartitionedCall/model/activation_4/Relu","StatefulPartitionedCall/model/depthwise_conv2d_5/depthwise/ReadVariableOp"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},
