{
  "format": "graph-model",
  "generatedBy": "https://github.com/PINTO0309/PINTO_model_zoo/tree/main/082_MediaPipe_Meet_Segmentation",
  "convertedBy": "https://github.com/vladmandic",
  "signature":
  {
      "inputs":
      {
          "input_1:0": {"name":"input_1:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"144"},{"size":"256"},{"size":"3"}]}}
      },
      "outputs":
      {
          "segment:0": {"name":"segment:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"144"},{"size":"256"},{"size":"2"}]}}
      }
  },
  "modelTopology":
  {
      "node":
      [
          {"name":"conv2d_transpose/input_sizes","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"conv2d_transpose/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"2"},{"size":"2"},{"size":"2"},{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"concatenate_2/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"conv2d_28/conv2d/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_28/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}}}},
          {"name":"conv2d_29/conv2d/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"16"},{"size":"16"}]}}}}},
          {"name":"conv2d_29/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"concatenate_1/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"conv2d_24/conv2d/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"16"}]}}}}},
          {"name":"conv2d_24/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_25/conv2d/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"16"},{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_25/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"concatenate/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"conv2d_20/conv2d/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"48"},{"size":"24"}]}}}}},
          {"name":"conv2d_20/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_21/conv2d/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_21/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}}}},
          {"name":"conv2d_17/conv2d/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"128"}]}}}}},
          {"name":"conv2d_17/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"mul_21/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"mul_19/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_14/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}}}},
          {"name":"mul_17/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"mul_15/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_13/conv2d/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"96"}]}}}}},
          {"name":"conv2d_13/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"add_7/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"depthwise_conv2d_6/depthwise_conv2d/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"96"},{"size":"1"}]}}}}},
          {"name":"depthwise_conv2d_6/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"add_8/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"dense_8/Tensordot/Reshape/shape","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"dense_8/kernel","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"},{"size":"96"}]}}}}},
          {"name":"dense_8/Tensordot/shape","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"dense_8/bias","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"dense_9/Tensordot/Reshape/shape","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"dense_9/kernel","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"},{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"dense_9/Tensordot/shape","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"dense_9/bias","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"conv2d_14/conv2d/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"32"}]}}}}},
          {"name":"conv2d_12/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"mul_13/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"mul_11/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_11/conv2d/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"128"}]}}}}},
          {"name":"conv2d_11/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"add_5/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_conv2d_5/depthwise_conv2d/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"128"},{"size":"1"}]}}}}},
          {"name":"depthwise_conv2d_5/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"add_6/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"dense_6/Tensordot/Reshape/shape","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"dense_6/kernel","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"},{"size":"128"}]}}}}},
          {"name":"dense_6/Tensordot/shape","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"dense_6/bias","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},
          {"name":"dense_7/Tensordot/Reshape/shape","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"dense_7/kernel","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"},{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"dense_7/Tensordot/shape","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"dense_7/bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_12/conv2d/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"32"}]}}}}},
          {"name":"conv2d_10/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}}}},
          {"name":"mul_9/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"mul_7/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_9/conv2d/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"128"}]}}}}},
          {"name":"conv2d_9/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},
          {"name":"add_3/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"depthwise_conv2d_4/depthwise_conv2d/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"128"},{"size":"1"}]}}}}},
          {"name":"depthwise_conv2d_4/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},
          {"name":"add_4/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"dense_4/Tensordot/Reshape/shape","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"dense_4/kernel","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"},{"size":"128"}]}}}}},
          {"name":"dense_4/Tensordot/shape","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"dense_4/bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"dense_5/Tensordot/Reshape/shape","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"dense_5/kernel","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"},{"size":"128"}]}}}}},
          {"name":"dense_5/Tensordot/shape","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"dense_5/bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_10/conv2d/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"32"}]}}}}},
          {"name":"mul_5/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"mul_3/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"conv2d_6/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}}}},
          {"name":"conv2d_5/conv2d/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"88"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_5/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"88"}]}}}}},
          {"name":"depthwise_conv2d_2/depthwise_conv2d/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"88"},{"size":"1"}]}}}}},
          {"name":"depthwise_conv2d_2/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"88"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_6/conv2d/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"88"},{"size":"24"}]}}}}},
          {"name":"mul_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"input_1","op":"Placeholder","attr":{"shape":{"shape":{"dim":[{"size":"1"},{"size":"144"},{"size":"256"},{"size":"3"}]}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d/conv2d/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"3"},{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}}}},
          {"name":"add/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_1/conv2d/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"16"},{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}}}},
          {"name":"depthwise_conv2d/depthwise_conv2d/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"16"},{"size":"1"}]}}}}},
          {"name":"depthwise_conv2d/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}}}},
          {"name":"dense/Tensordot/Reshape/shape","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"dense/kernel","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"},{"size":"16"}]}}}}},
          {"name":"dense/Tensordot/shape","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"dense/bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"dense_1/Tensordot/Reshape/shape","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"dense_1/kernel","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"},{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"dense_1/Tensordot/shape","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"dense_1/bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_2/conv2d/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"16"},{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_2/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}}}},
          {"name":"conv2d_3/conv2d/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"16"},{"size":"72"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_3/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"72"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_conv2d_1/depthwise_conv2d/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"72"},{"size":"1"}]}}}}},
          {"name":"depthwise_conv2d_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"72"}]}}}}},
          {"name":"conv2d_4/conv2d/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"72"},{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_4/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_7/conv2d/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"96"}]}}}}},
          {"name":"conv2d_7/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"add_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"depthwise_conv2d_3/depthwise_conv2d/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"96"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_conv2d_3/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"add_2/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"dense_2/Tensordot/Reshape/shape","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"dense_2/kernel","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"},{"size":"96"}]}}}}},
          {"name":"dense_2/Tensordot/shape","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"dense_2/bias","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"dense_3/Tensordot/Reshape/shape","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"dense_3/kernel","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"},{"size":"96"}]}}}}},
          {"name":"dense_3/Tensordot/shape","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"dense_3/bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_8/conv2d/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"32"}]}}}}},
          {"name":"conv2d_8/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}}}},
          {"name":"conv2d_15/conv2d/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"72"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_15/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"72"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"add_9/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"depthwise_conv2d_7/depthwise_conv2d/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"72"},{"size":"1"}]}}}}},
          {"name":"depthwise_conv2d_7/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"72"}]}}}}},
          {"name":"add_10/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"dense_10/Tensordot/Reshape/shape","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"dense_10/kernel","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"72"},{"size":"72"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"dense_10/Tensordot/shape","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"dense_10/bias","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"72"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"dense_11/Tensordot/Reshape/shape","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"dense_11/kernel","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"72"},{"size":"72"}]}}}}},
          {"name":"dense_11/Tensordot/shape","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"dense_11/bias","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"72"}]}}}}},
          {"name":"conv2d_16/conv2d/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"72"},{"size":"24"}]}}}}},
          {"name":"conv2d_16/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}}}},
          {"name":"conv2d_18/conv2d/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"128"}]}}}}},
          {"name":"conv2d_18/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},
          {"name":"lambda/resize/size","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"conv2d_19/conv2d/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_19/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_22/conv2d/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"24"}]}}}}},
          {"name":"conv2d_22/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_conv2d_8/depthwise_conv2d/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"24"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_conv2d_8/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"lambda_1/resize/size","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"conv2d_23/conv2d/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"16"}]}}}}},
          {"name":"conv2d_23/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}}}},
          {"name":"conv2d_26/conv2d/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"16"},{"size":"16"}]}}}}},
          {"name":"conv2d_26/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}}}},
          {"name":"depthwise_conv2d_9/depthwise_conv2d/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"16"},{"size":"1"}]}}}}},
          {"name":"depthwise_conv2d_9/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"lambda_2/resize/size","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"conv2d_27/conv2d/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"16"},{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_27/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_30/conv2d/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"16"},{"size":"16"}]}}}}},
          {"name":"conv2d_30/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}}}},
          {"name":"depthwise_conv2d_10/depthwise_conv2d/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"16"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_conv2d_10/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}}}},
          {"name":"segment/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d/conv2d","op":"Conv2D","input":["input_1","conv2d/conv2d/filter"],"device":"/device:CPU:0","attr":{"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"strides":{"list":{"i":["1","2","2","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"}}},
          {"name":"conv2d","op":"Add","input":["conv2d/conv2d","conv2d/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul","op":"Mul","input":["mul_1/y","conv2d"],"attr":{"T":{"type":"DT_FLOAT"},"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true}}},
          {"name":"add","op":"AddV2","input":["conv2d","add/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Relu6","op":"Relu6","input":["add"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_1","op":"Mul","input":["mul","Relu6"],"attr":{"T":{"type":"DT_FLOAT"},"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true}}},
          {"name":"conv2d_1/conv2d","op":"Conv2D","input":["mul_1","conv2d_1/conv2d/filter"],"device":"/device:CPU:0","attr":{"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"conv2d_1","op":"Add","input":["conv2d_1/conv2d","conv2d_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"re_lu","op":"Relu6","input":["conv2d_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_conv2d/depthwise_conv2d","op":"DepthwiseConv2dNative","input":["re_lu","depthwise_conv2d/depthwise_conv2d/filter_in"],"attr":{"strides":{"list":{"i":["1","2","2","1"]}},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="}}},
          {"name":"depthwise_conv2d","op":"Add","input":["depthwise_conv2d/depthwise_conv2d","depthwise_conv2d/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"re_lu_1","op":"Relu6","input":["depthwise_conv2d"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"average_pooling2d/AvgPool","op":"AvgPool","input":["re_lu_1"],"attr":{"ksize":{"list":{"i":["1","36","64","1"]}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"VkFMSUQ="},"strides":{"list":{"i":["1","36","64","1"]}},"T":{"type":"DT_FLOAT"}}},
          {"name":"dense/Tensordot/Reshape","op":"Reshape","input":["average_pooling2d/AvgPool","dense/Tensordot/Reshape/shape"],"attr":{"T":{"type":"DT_FLOAT"},"Tshape":{"type":"DT_INT32"}}},
          {"name":"dense/Tensordot/MatMul","op":"MatMul","input":["dense/Tensordot/Reshape","dense/kernel"],"device":"/device:CPU:0","attr":{"transpose_b":{"b":false},"transpose_a":{"b":false},"T":{"type":"DT_FLOAT"}}},
          {"name":"dense/Tensordot","op":"Reshape","input":["dense/Tensordot/MatMul","dense/Tensordot/shape"],"attr":{"T":{"type":"DT_FLOAT"},"Tshape":{"type":"DT_INT32"}}},
          {"name":"dense/BiasAdd","op":"BiasAdd","input":["dense/Tensordot","dense/bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},
          {"name":"re_lu_2","op":"Relu","input":["dense/BiasAdd"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"dense_1/Tensordot/Reshape","op":"Reshape","input":["re_lu_2","dense_1/Tensordot/Reshape/shape"],"attr":{"T":{"type":"DT_FLOAT"},"Tshape":{"type":"DT_INT32"}}},
          {"name":"dense_1/Tensordot/MatMul","op":"MatMul","input":["dense_1/Tensordot/Reshape","dense_1/kernel"],"device":"/device:CPU:0","attr":{"transpose_a":{"b":false},"transpose_b":{"b":false},"T":{"type":"DT_FLOAT"}}},
          {"name":"dense_1/Tensordot","op":"Reshape","input":["dense_1/Tensordot/MatMul","dense_1/Tensordot/shape"],"attr":{"T":{"type":"DT_FLOAT"},"Tshape":{"type":"DT_INT32"}}},
          {"name":"dense_1/BiasAdd","op":"BiasAdd","input":["dense_1/Tensordot","dense_1/bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},
          {"name":"activation","op":"Sigmoid","input":["dense_1/BiasAdd"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"multiply","op":"Mul","input":["re_lu_1","activation"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_2/conv2d","op":"Conv2D","input":["multiply","conv2d_2/conv2d/filter"],"device":"/device:CPU:0","attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"conv2d_2","op":"Add","input":["conv2d_2/conv2d","conv2d_2/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_3/conv2d","op":"Conv2D","input":["conv2d_2","conv2d_3/conv2d/filter"],"device":"/device:CPU:0","attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},
          {"name":"conv2d_3","op":"Add","input":["conv2d_3/conv2d","conv2d_3/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"re_lu_3","op":"Relu6","input":["conv2d_3"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_conv2d_1/depthwise_conv2d","op":"DepthwiseConv2dNative","input":["re_lu_3","depthwise_conv2d_1/depthwise_conv2d/filter_in"],"attr":{"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","2","2","1"]}},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"depthwise_conv2d_1","op":"Add","input":["depthwise_conv2d_1/depthwise_conv2d","depthwise_conv2d_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"re_lu_4","op":"Relu6","input":["depthwise_conv2d_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_4/conv2d","op":"Conv2D","input":["re_lu_4","conv2d_4/conv2d/filter"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},
          {"name":"conv2d_4","op":"Add","input":["conv2d_4/conv2d","conv2d_4/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_5/conv2d","op":"Conv2D","input":["conv2d_4","conv2d_5/conv2d/filter"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="}}},
          {"name":"conv2d_5","op":"Add","input":["conv2d_5/conv2d","conv2d_5/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"re_lu_5","op":"Relu6","input":["conv2d_5"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_conv2d_2/depthwise_conv2d","op":"DepthwiseConv2dNative","input":["re_lu_5","depthwise_conv2d_2/depthwise_conv2d/filter_in"],"attr":{"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"depthwise_conv2d_2","op":"Add","input":["depthwise_conv2d_2/depthwise_conv2d","depthwise_conv2d_2/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"re_lu_6","op":"Relu6","input":["depthwise_conv2d_2"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_6/conv2d","op":"Conv2D","input":["re_lu_6","conv2d_6/conv2d/filter"],"device":"/device:CPU:0","attr":{"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"}}},
          {"name":"ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add__xeno_compat__1","op":"AddN","input":["conv2d_6/conv2d","conv2d_4"],"attr":{"_grappler_ArithmeticOptimizer_AddOpsRewriteStage":{"b":true},"N":{"i":"2"},"T":{"type":"DT_FLOAT"}}},
          {"name":"ArithmeticOptimizer/AddOpsRewrite_add__xeno_compat__1","op":"AddV2","input":["conv2d_6/y","ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add__xeno_compat__1"],"attr":{"_grappler_ArithmeticOptimizer_AddOpsRewriteStage":{"b":true},"T":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_7/conv2d","op":"Conv2D","input":["ArithmeticOptimizer/AddOpsRewrite_add__xeno_compat__1","conv2d_7/conv2d/filter"],"device":"/device:CPU:0","attr":{"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"conv2d_7","op":"Add","input":["conv2d_7/conv2d","conv2d_7/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_2","op":"Mul","input":["mul_3/y","conv2d_7"],"attr":{"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true},"T":{"type":"DT_FLOAT"}}},
          {"name":"add_1","op":"AddV2","input":["conv2d_7","add_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Relu6_1","op":"Relu6","input":["add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_3","op":"Mul","input":["mul_2","Relu6_1"],"attr":{"T":{"type":"DT_FLOAT"},"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true}}},
          {"name":"depthwise_conv2d_3/depthwise_conv2d","op":"DepthwiseConv2dNative","input":["mul_3","depthwise_conv2d_3/depthwise_conv2d/filter_in"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","2","2","1"]}},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},
          {"name":"depthwise_conv2d_3","op":"Add","input":["depthwise_conv2d_3/depthwise_conv2d","depthwise_conv2d_3/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_4","op":"Mul","input":["mul_5/y","depthwise_conv2d_3"],"attr":{"T":{"type":"DT_FLOAT"},"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true}}},
          {"name":"add_2","op":"AddV2","input":["depthwise_conv2d_3","add_2/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Relu6_2","op":"Relu6","input":["add_2"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_5","op":"Mul","input":["mul_4","Relu6_2"],"attr":{"T":{"type":"DT_FLOAT"},"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true}}},
          {"name":"average_pooling2d_1/AvgPool","op":"AvgPool","input":["mul_5"],"attr":{"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","9","16","1"]}},"ksize":{"list":{"i":["1","9","16","1"]}},"padding":{"s":"VkFMSUQ="},"T":{"type":"DT_FLOAT"}}},
          {"name":"dense_2/Tensordot/Reshape","op":"Reshape","input":["average_pooling2d_1/AvgPool","dense_2/Tensordot/Reshape/shape"],"attr":{"T":{"type":"DT_FLOAT"},"Tshape":{"type":"DT_INT32"}}},
          {"name":"dense_2/Tensordot/MatMul","op":"MatMul","input":["dense_2/Tensordot/Reshape","dense_2/kernel"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"transpose_b":{"b":false},"transpose_a":{"b":false}}},
          {"name":"dense_2/Tensordot","op":"Reshape","input":["dense_2/Tensordot/MatMul","dense_2/Tensordot/shape"],"attr":{"T":{"type":"DT_FLOAT"},"Tshape":{"type":"DT_INT32"}}},
          {"name":"dense_2/BiasAdd","op":"BiasAdd","input":["dense_2/Tensordot","dense_2/bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},
          {"name":"re_lu_7","op":"Relu","input":["dense_2/BiasAdd"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"dense_3/Tensordot/Reshape","op":"Reshape","input":["re_lu_7","dense_3/Tensordot/Reshape/shape"],"attr":{"T":{"type":"DT_FLOAT"},"Tshape":{"type":"DT_INT32"}}},
          {"name":"dense_3/Tensordot/MatMul","op":"MatMul","input":["dense_3/Tensordot/Reshape","dense_3/kernel"],"device":"/device:CPU:0","attr":{"transpose_b":{"b":false},"transpose_a":{"b":false},"T":{"type":"DT_FLOAT"}}},
          {"name":"dense_3/Tensordot","op":"Reshape","input":["dense_3/Tensordot/MatMul","dense_3/Tensordot/shape"],"attr":{"T":{"type":"DT_FLOAT"},"Tshape":{"type":"DT_INT32"}}},
          {"name":"dense_3/BiasAdd","op":"BiasAdd","input":["dense_3/Tensordot","dense_3/bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_1","op":"Sigmoid","input":["dense_3/BiasAdd"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"multiply_1","op":"Mul","input":["mul_5","activation_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_8/conv2d","op":"Conv2D","input":["multiply_1","conv2d_8/conv2d/filter"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"conv2d_8","op":"Add","input":["conv2d_8/conv2d","conv2d_8/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_9/conv2d","op":"Conv2D","input":["conv2d_8","conv2d_9/conv2d/filter"],"device":"/device:CPU:0","attr":{"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"conv2d_9","op":"Add","input":["conv2d_9/conv2d","conv2d_9/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_6","op":"Mul","input":["mul_7/y","conv2d_9"],"attr":{"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true},"T":{"type":"DT_FLOAT"}}},
          {"name":"add_3","op":"AddV2","input":["conv2d_9","add_3/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Relu6_3","op":"Relu6","input":["add_3"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_7","op":"Mul","input":["mul_6","Relu6_3"],"attr":{"T":{"type":"DT_FLOAT"},"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true}}},
          {"name":"depthwise_conv2d_4/depthwise_conv2d","op":"DepthwiseConv2dNative","input":["mul_7","depthwise_conv2d_4/depthwise_conv2d/filter_in"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},
          {"name":"depthwise_conv2d_4","op":"Add","input":["depthwise_conv2d_4/depthwise_conv2d","depthwise_conv2d_4/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_8","op":"Mul","input":["mul_9/y","depthwise_conv2d_4"],"attr":{"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true},"T":{"type":"DT_FLOAT"}}},
          {"name":"add_4","op":"AddV2","input":["depthwise_conv2d_4","add_4/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Relu6_4","op":"Relu6","input":["add_4"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_9","op":"Mul","input":["mul_8","Relu6_4"],"attr":{"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true},"T":{"type":"DT_FLOAT"}}},
          {"name":"average_pooling2d_2/AvgPool","op":"AvgPool","input":["mul_9"],"attr":{"padding":{"s":"VkFMSUQ="},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","9","16","1"]}},"ksize":{"list":{"i":["1","9","16","1"]}}}},
          {"name":"dense_4/Tensordot/Reshape","op":"Reshape","input":["average_pooling2d_2/AvgPool","dense_4/Tensordot/Reshape/shape"],"attr":{"Tshape":{"type":"DT_INT32"},"T":{"type":"DT_FLOAT"}}},
          {"name":"dense_4/Tensordot/MatMul","op":"MatMul","input":["dense_4/Tensordot/Reshape","dense_4/kernel"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"transpose_b":{"b":false},"transpose_a":{"b":false}}},
          {"name":"dense_4/Tensordot","op":"Reshape","input":["dense_4/Tensordot/MatMul","dense_4/Tensordot/shape"],"attr":{"T":{"type":"DT_FLOAT"},"Tshape":{"type":"DT_INT32"}}},
          {"name":"dense_4/BiasAdd","op":"BiasAdd","input":["dense_4/Tensordot","dense_4/bias"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},
          {"name":"re_lu_8","op":"Relu","input":["dense_4/BiasAdd"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"dense_5/Tensordot/Reshape","op":"Reshape","input":["re_lu_8","dense_5/Tensordot/Reshape/shape"],"attr":{"Tshape":{"type":"DT_INT32"},"T":{"type":"DT_FLOAT"}}},
          {"name":"dense_5/Tensordot/MatMul","op":"MatMul","input":["dense_5/Tensordot/Reshape","dense_5/kernel"],"device":"/device:CPU:0","attr":{"transpose_b":{"b":false},"transpose_a":{"b":false},"T":{"type":"DT_FLOAT"}}},
          {"name":"dense_5/Tensordot","op":"Reshape","input":["dense_5/Tensordot/MatMul","dense_5/Tensordot/shape"],"attr":{"T":{"type":"DT_FLOAT"},"Tshape":{"type":"DT_INT32"}}},
          {"name":"dense_5/BiasAdd","op":"BiasAdd","input":["dense_5/Tensordot","dense_5/bias"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_2","op":"Sigmoid","input":["dense_5/BiasAdd"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"multiply_2","op":"Mul","input":["mul_9","activation_2"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_10/conv2d","op":"Conv2D","input":["multiply_2","conv2d_10/conv2d/filter"],"device":"/device:CPU:0","attr":{"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"use_cudnn_on_gpu":{"b":true}}},
          {"name":"ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add_1__xeno_compat__1","op":"AddN","input":["conv2d_10/conv2d","conv2d_8"],"attr":{"N":{"i":"2"},"_grappler_ArithmeticOptimizer_AddOpsRewriteStage":{"b":true},"T":{"type":"DT_FLOAT"}}},
          {"name":"ArithmeticOptimizer/AddOpsRewrite_add_1__xeno_compat__1","op":"AddV2","input":["conv2d_10/y","ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add_1__xeno_compat__1"],"attr":{"_grappler_ArithmeticOptimizer_AddOpsRewriteStage":{"b":true},"T":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_11/conv2d","op":"Conv2D","input":["ArithmeticOptimizer/AddOpsRewrite_add_1__xeno_compat__1","conv2d_11/conv2d/filter"],"device":"/device:CPU:0","attr":{"use_cudnn_on_gpu":{"b":true},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},
          {"name":"conv2d_11","op":"Add","input":["conv2d_11/conv2d","conv2d_11/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_10","op":"Mul","input":["mul_11/y","conv2d_11"],"attr":{"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true},"T":{"type":"DT_FLOAT"}}},
          {"name":"add_5","op":"AddV2","input":["conv2d_11","add_5/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Relu6_5","op":"Relu6","input":["add_5"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_11","op":"Mul","input":["mul_10","Relu6_5"],"attr":{"T":{"type":"DT_FLOAT"},"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true}}},
          {"name":"depthwise_conv2d_5/depthwise_conv2d","op":"DepthwiseConv2dNative","input":["mul_11","depthwise_conv2d_5/depthwise_conv2d/filter_in"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"depthwise_conv2d_5","op":"Add","input":["depthwise_conv2d_5/depthwise_conv2d","depthwise_conv2d_5/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_12","op":"Mul","input":["mul_13/y","depthwise_conv2d_5"],"attr":{"T":{"type":"DT_FLOAT"},"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true}}},
          {"name":"add_6","op":"AddV2","input":["depthwise_conv2d_5","add_6/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Relu6_6","op":"Relu6","input":["add_6"],"attr":{"T":{"type":"DT_FLOAT"}}},
