{
  "format": "graph-model",
  "generatedBy": "https://github.com/RangiLyu/nanodet",
  "convertedBy": "https://github.com/vladmandic",
  "signature":
  {
      "inputs":
      {
          "input_1:0": {"name":"input_1:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"3"},{"size":"416"},{"size":"416"}]}}
      },
      "outputs":
      {
          "Identity_1:0": {"name":"Identity_1:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"676"},{"size":"80"}]}},
          "Identity_2:0": {"name":"Identity_2:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"169"},{"size":"80"}]}},
          "Identity_3:0": {"name":"Identity_3:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"2704"},{"size":"32"}]}},
          "Identity_5:0": {"name":"Identity_5:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"169"},{"size":"32"}]}},
          "Identity:0": {"name":"Identity:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"2704"},{"size":"80"}]}},
          "Identity_4:0": {"name":"Identity_4:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"676"},{"size":"32"}]}}
      }
  },
  "modelTopology":
  {
      "node":
      [
          {"name":"PartitionedCall/Where_32","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{},{"size":"1"}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/Cast_40","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/GatherV2_32","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{}]}}}}},
          {"name":"PartitionedCall/zeros_32","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{}}}}},
          {"name":"PartitionedCall/onnx_tf_prefix_Transpose_301/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/Where_34","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{},{"size":"1"}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/Cast_42","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"PartitionedCall/GatherV2_34","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{}]}}}}},
          {"name":"PartitionedCall/zeros_34","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/onnx_tf_prefix_Transpose_318/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"unknown_135","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"PartitionedCall/Where_36","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{},{"size":"1"}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/Cast_44","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"PartitionedCall/GatherV2_36","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{}]}}}}},
          {"name":"PartitionedCall/zeros_36","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{}}}}},
          {"name":"PartitionedCall/onnx_tf_prefix_Transpose_335/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"PartitionedCall/Const_104","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/transpose_185/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/Reshape_19","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"96"},{"size":"1"}]}}}}},
          {"name":"unknown_126","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"PartitionedCall/transpose_186/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/transpose_188/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/split_39","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"96"}]}}}}},
          {"name":"unknown_128","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"PartitionedCall/transpose_189/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/Const_106","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/transpose_191/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/Reshape_20","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"96"},{"size":"1"}]}}}}},
          {"name":"unknown_130","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"PartitionedCall/transpose_192/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/transpose_194/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/split_40","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"unknown_132","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"PartitionedCall/transpose_195/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/transpose_197/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/split_41","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"112"}]}}}}},
          {"name":"unknown_134","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"112"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"PartitionedCall/transpose_198/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/Const_109","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"PartitionedCall/onnx_tf_prefix_Split_297/split_dim","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/Where_33","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{},{"size":"1"}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/Cast_41","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"PartitionedCall/GatherV2_33","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{}]}}}}},
          {"name":"PartitionedCall/zeros_33","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{}}}}},
          {"name":"PartitionedCall/onnx_tf_prefix_Transpose_304/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"PartitionedCall/Const_112","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"PartitionedCall/transpose_200/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/Reshape_21","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"96"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"unknown_138","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"PartitionedCall/transpose_201/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/transpose_203/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/split_42","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"unknown_140","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"PartitionedCall/transpose_204/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/Const_114","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"PartitionedCall/transpose_206/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/Reshape_22","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"96"},{"size":"1"}]}}}}},
          {"name":"unknown_142","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"PartitionedCall/transpose_207/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/transpose_209/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/split_43","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"unknown_144","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"PartitionedCall/transpose_210/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/transpose_212/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/split_44","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"112"}]}}}}},
          {"name":"unknown_146","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"112"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"PartitionedCall/transpose_213/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/Const_117","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/onnx_tf_prefix_Split_314/split_dim","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/Where_35","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{},{"size":"1"}]}}}}},
          {"name":"PartitionedCall/Cast_43","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"PartitionedCall/GatherV2_35","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{}]}}}}},
          {"name":"PartitionedCall/zeros_35","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/onnx_tf_prefix_Transpose_321/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"PartitionedCall/transpose_175/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/transpose_168/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/split_36","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"116"},{"size":"96"}]}}}}},
          {"name":"unknown_116","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"PartitionedCall/transpose_169/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/transpose_171/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/split_37","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"232"},{"size":"96"}]}}}}},
          {"name":"unknown_118","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"PartitionedCall/transpose_172/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/Const_76","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/transpose_126/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/Reshape_14","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"232"},{"size":"1"}]}}}}},
          {"name":"unknown_86","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"232"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"PartitionedCall/split_27","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"232"},{"size":"232"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"unknown_88","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"232"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"PartitionedCall/transpose_130/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/Const_27","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"PartitionedCall/transpose_48/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/Reshape_5","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"116"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"unknown_32","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"116"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"PartitionedCall/split_10","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"116"},{"size":"116"}]}}}}},
          {"name":"unknown_34","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"116"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"PartitionedCall/transpose_52/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/transpose_4/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/Const_2","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"PartitionedCall/transpose_6/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/Reshape","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"24"},{"size":"1"}]}}}}},
          {"name":"unknown_2","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}}}},
          {"name":"PartitionedCall/split_1","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"58"}]}}}}},
          {"name":"unknown_4","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"58"}]}}}}},
          {"name":"PartitionedCall/transpose_10/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/Const","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/transpose_1/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/split","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"3"},{"size":"24"}]}}}}},
          {"name":"unknown_0","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"PartitionedCall/transpose_2/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/PadV2/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"PartitionedCall/PadV2/constant_values","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"PartitionedCall/transpose_3/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/split_2","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"58"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"unknown_6","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"58"}]}}}}},
          {"name":"PartitionedCall/transpose_13/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/Const_5","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"PartitionedCall/transpose_15/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/Reshape_1","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"58"},{"size":"1"}]}}}}},
          {"name":"unknown_8","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"58"}]}}}}},
          {"name":"PartitionedCall/split_3","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"58"},{"size":"58"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"unknown_10","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"58"}]}}}}},
          {"name":"PartitionedCall/transpose_19/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/onnx_tf_prefix_Concat_11/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"PartitionedCall/Where","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{},{"size":"1"}]}}}}},
          {"name":"PartitionedCall/Cast","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"PartitionedCall/GatherV2","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{}]}}}}},
          {"name":"PartitionedCall/zeros","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/onnx_tf_prefix_Transpose_14/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"5"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/Where_1","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{},{"size":"1"}]}}}}},
          {"name":"PartitionedCall/Cast_1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/GatherV2_1","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{}]}}}}},
          {"name":"PartitionedCall/zeros_1","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{}}}}},
          {"name":"PartitionedCall/Const_9","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/onnx_tf_prefix_Split_17/split_dim","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"PartitionedCall/transpose_21/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/split_4","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"58"},{"size":"58"}]}}}}},
          {"name":"unknown_14","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"58"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"PartitionedCall/transpose_22/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/Const_11","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/transpose_24/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/Reshape_2","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"58"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"unknown_16","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"58"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"PartitionedCall/split_5","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"58"},{"size":"58"}]}}}}},
          {"name":"unknown_18","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"58"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"PartitionedCall/transpose_28/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/onnx_tf_prefix_Concat_23/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"PartitionedCall/Where_2","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{},{"size":"1"}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/Cast_2","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/GatherV2_2","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{}]}}}}},
          {"name":"PartitionedCall/zeros_2","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{}}}}},
          {"name":"PartitionedCall/onnx_tf_prefix_Transpose_26/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"5"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/Where_3","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{},{"size":"1"}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/Cast_3","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"PartitionedCall/GatherV2_3","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/zeros_3","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/Const_15","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/onnx_tf_prefix_Split_29/split_dim","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"PartitionedCall/transpose_30/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/split_6","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"58"},{"size":"58"}]}}}}},
          {"name":"unknown_20","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"58"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"PartitionedCall/transpose_31/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/Const_17","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/transpose_33/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/Reshape_3","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"58"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"unknown_22","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"58"}]}}}}},
          {"name":"PartitionedCall/split_7","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"58"},{"size":"58"}]}}}}},
          {"name":"unknown_24","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"58"}]}}}}},
          {"name":"PartitionedCall/transpose_37/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/onnx_tf_prefix_Concat_35/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"PartitionedCall/Where_4","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{},{"size":"1"}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/Cast_4","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"PartitionedCall/GatherV2_4","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{}]}}}}},
          {"name":"PartitionedCall/zeros_4","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{}}}}},
          {"name":"PartitionedCall/onnx_tf_prefix_Transpose_38/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"5"}]}}}}},
          {"name":"PartitionedCall/Where_5","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{},{"size":"1"}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/Cast_5","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"PartitionedCall/GatherV2_5","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{}]}}}}},
          {"name":"PartitionedCall/zeros_5","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{}}}}},
          {"name":"PartitionedCall/Const_21","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/onnx_tf_prefix_Split_41/split_dim","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"PartitionedCall/transpose_39/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/split_8","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"58"},{"size":"58"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"unknown_26","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"58"}]}}}}},
          {"name":"PartitionedCall/transpose_40/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/Const_23","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"PartitionedCall/transpose_42/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/Reshape_4","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"58"},{"size":"1"}]}}}}},
          {"name":"unknown_28","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"58"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"PartitionedCall/split_9","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"58"},{"size":"58"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"unknown_30","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"58"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"PartitionedCall/transpose_46/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/onnx_tf_prefix_Concat_47/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"unknown_11","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"5"}]}}}}},
          {"name":"PartitionedCall/Where_6","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{},{"size":"1"}]}}}}},
          {"name":"PartitionedCall/Cast_6","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/GatherV2_6","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/zeros_6","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{}}}}},
          {"name":"PartitionedCall/onnx_tf_prefix_Transpose_50/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"5"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"unknown_12","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/Where_7","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{},{"size":"1"}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/Cast_7","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/GatherV2_7","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/zeros_7","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/transpose_54/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/split_11","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"116"},{"size":"116"}]}}}}},
          {"name":"unknown_36","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"116"}]}}}}},
          {"name":"PartitionedCall/transpose_55/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/Const_30","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/transpose_57/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/Reshape_6","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"116"},{"size":"1"}]}}}}},
          {"name":"unknown_38","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"116"}]}}}}},
          {"name":"PartitionedCall/split_12","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"116"},{"size":"116"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"unknown_40","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"116"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"PartitionedCall/transpose_61/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/onnx_tf_prefix_Concat_61/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"PartitionedCall/Where_8","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{},{"size":"1"}]}}}}},
          {"name":"PartitionedCall/Cast_8","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/GatherV2_8","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{}]}}}}},
          {"name":"PartitionedCall/zeros_8","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{}}}}},
          {"name":"PartitionedCall/onnx_tf_prefix_Transpose_64/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"5"}]}}}}},
          {"name":"PartitionedCall/Where_9","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{},{"size":"1"}]}}}}},
          {"name":"PartitionedCall/Cast_9","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"PartitionedCall/GatherV2_9","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/zeros_9","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/Const_34","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"PartitionedCall/onnx_tf_prefix_Split_67/split_dim","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"PartitionedCall/transpose_63/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/split_13","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"116"},{"size":"116"}]}}}}},
          {"name":"unknown_44","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"116"}]}}}}},
          {"name":"PartitionedCall/transpose_64/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/Const_36","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"PartitionedCall/transpose_66/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/Reshape_7","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"116"},{"size":"1"}]}}}}},
          {"name":"unknown_46","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"116"}]}}}}},
          {"name":"PartitionedCall/split_14","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"116"},{"size":"116"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"unknown_48","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"116"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"PartitionedCall/transpose_70/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/onnx_tf_prefix_Concat_73/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/Where_10","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{},{"size":"1"}]}}}}},
          {"name":"PartitionedCall/Cast_10","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/GatherV2_10","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{}]}}}}},
          {"name":"PartitionedCall/zeros_10","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{}}}}},
          {"name":"PartitionedCall/onnx_tf_prefix_Transpose_76/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"5"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/Where_11","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{},{"size":"1"}]}}}}},
          {"name":"PartitionedCall/Cast_11","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/GatherV2_11","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/zeros_11","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/Const_40","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"PartitionedCall/onnx_tf_prefix_Split_79/split_dim","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"PartitionedCall/transpose_72/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/split_15","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"116"},{"size":"116"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"unknown_50","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"116"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"PartitionedCall/transpose_73/perm","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/Const_42","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/transpose_75/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/Reshape_8","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"116"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"unknown_52","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"116"}]}}}}},
          {"name":"PartitionedCall/split_16","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"116"},{"size":"116"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"unknown_54","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"116"}]}}}}},
          {"name":"PartitionedCall/transpose_79/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"PartitionedCall/onnx_tf_prefix_Concat_85/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"PartitionedCall/Where_12","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{},{"size":"1"}]}}}}},
          {"name":"PartitionedCall/Cast_12","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/GatherV2_12","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/zeros_12","op":"Const","attr":{"dtype":{"type":"DT_INT64"},"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{}}}}},
          {"name":"PartitionedCall/onnx_tf_prefix_Transpose_88/perm","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"5"}]}}}}},
          {"name":"PartitionedCall/Where_13","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{},{"size":"1"}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/Cast_13","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT64"}}},
          {"name":"PartitionedCall/GatherV2_13","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT64","tensorShape":{"dim":[{}]}}},"dtype":{"type":"DT_INT64"}}},
