{
  "format": "graph-model",
  "generatedBy": "https://github.com/atomicbits/posenet-python",
  "convertedBy": "https://github.com/vladmandic",
  "signature":
  {
    "inputs":
    {
      "image:0": {"name":"image:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"385"},{"size":"385"},{"size":"3"}]}}
    },
    "outputs":
    {
      "MobilenetV1/displacement_fwd_2/BiasAdd:0": {"name":"MobilenetV1/displacement_fwd_2/BiasAdd:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"25"},{"size":"25"},{"size":"32"}]}},
      "MobilenetV1/heatmap_2/BiasAdd:0": {"name":"MobilenetV1/heatmap_2/BiasAdd:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"25"},{"size":"25"},{"size":"17"}]}},
      "MobilenetV1/displacement_bwd_2/BiasAdd:0": {"name":"MobilenetV1/displacement_bwd_2/BiasAdd:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"25"},{"size":"25"},{"size":"32"}]}},
      "MobilenetV1/offset_2/BiasAdd:0": {"name":"MobilenetV1/offset_2/BiasAdd:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"25"},{"size":"25"},{"size":"34"}]}}
    }
  },
  "modelTopology":
  {
      "node":
      [
          {"name":"Const_61","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_60","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_59","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_58","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_57","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"17"}]}}}}},
          {"name":"Const_56","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"17"}]}}}}},
          {"name":"Const_55","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"3"},{"size":"24"}]}}}}},
          {"name":"Const_54","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}}}},
          {"name":"Const_53","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"24"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_52","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_51","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"48"}]}}}}},
          {"name":"Const_50","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}}}},
          {"name":"Const_49","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"48"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_48","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_47","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"48"},{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_46","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"Const_45","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"96"},{"size":"1"}]}}}}},
          {"name":"Const_44","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"Const_43","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"96"}]}}}}},
          {"name":"Const_42","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_41","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"96"},{"size":"1"}]}}}}},
          {"name":"Const_40","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_39","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"192"}]}}}}},
          {"name":"Const_38","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"Const_37","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_36","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"Const_35","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_34","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"Const_33","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"192"},{"size":"1"}]}}}}},
          {"name":"Const_32","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"Const_31","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_30","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_29","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"384"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_28","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}}}},
          {"name":"Const_27","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"384"}]}}}}},
          {"name":"Const_26","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_25","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"384"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_24","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_23","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"384"}]}}}}},
          {"name":"Const_22","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_21","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"384"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_20","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_19","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_18","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}}}},
          {"name":"Const_17","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"384"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_16","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_15","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_14","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_13","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"384"},{"size":"1"}]}}}}},
          {"name":"Const_12","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}}}},
          {"name":"Const_11","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"384"}]}}}}},
          {"name":"Const_10","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_9","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"384"},{"size":"1"}]}}}}},
          {"name":"Const_8","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}}}},
          {"name":"Const_7","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"384"}]}}}}},
          {"name":"Const_6","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_5","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"384"},{"size":"1"}]}}}}},
          {"name":"Const_4","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_3","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_2","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const_1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"34"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Const","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"34"}]}}}}},
          {"name":"image","op":"Placeholder","attr":{"shape":{"shape":{"dim":[{"size":"1"},{"size":"385"},{"size":"385"},{"size":"3"}]}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"MobilenetV1/MobilenetV1/Conv2d_0/Relu6","op":"_FusedConv2D","input":["image","Const_55","Const_54"],"device":"/device:CPU:0","attr":{"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"use_cudnn_on_gpu":{"b":true},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","2","2","1"]}},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"epsilon":{"f":0},"padding":{"s":"U0FNRQ=="},"num_args":{"i":"1"}}},
          {"name":"MobilenetV1/MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm/add_1/conv","op":"FusedDepthwiseConv2dNative","input":["MobilenetV1/MobilenetV1/Conv2d_0/Relu6","Const_53","Const_52"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"explicit_paddings":{"list":{}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"num_args":{"i":"1"}}},
          {"name":"MobilenetV1/MobilenetV1/Conv2d_1_pointwise/Relu6","op":"_FusedConv2D","input":["MobilenetV1/MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm/add_1/conv","Const_51","Const_50"],"device":"/device:CPU:0","attr":{"num_args":{"i":"1"},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"explicit_paddings":{"list":{}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"T":{"type":"DT_FLOAT"},"epsilon":{"f":0},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"MobilenetV1/MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm/add_1/conv","op":"FusedDepthwiseConv2dNative","input":["MobilenetV1/MobilenetV1/Conv2d_1_pointwise/Relu6","Const_49","Const_48"],"attr":{"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","2","2","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"num_args":{"i":"1"},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="}}},
          {"name":"MobilenetV1/MobilenetV1/Conv2d_2_pointwise/Relu6","op":"_FusedConv2D","input":["MobilenetV1/MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm/add_1/conv","Const_47","Const_46"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"num_args":{"i":"1"},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"epsilon":{"f":0},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"explicit_paddings":{"list":{}}}},
          {"name":"MobilenetV1/MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm/add_1/conv","op":"FusedDepthwiseConv2dNative","input":["MobilenetV1/MobilenetV1/Conv2d_2_pointwise/Relu6","Const_45","Const_44"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"padding":{"s":"U0FNRQ=="},"num_args":{"i":"1"},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","1","1","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}}}},
          {"name":"MobilenetV1/MobilenetV1/Conv2d_3_pointwise/Relu6","op":"_FusedConv2D","input":["MobilenetV1/MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm/add_1/conv","Const_43","Const_42"],"device":"/device:CPU:0","attr":{"num_args":{"i":"1"},"data_format":{"s":"TkhXQw=="},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"epsilon":{"f":0},"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},
          {"name":"MobilenetV1/MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm/add_1/conv","op":"FusedDepthwiseConv2dNative","input":["MobilenetV1/MobilenetV1/Conv2d_3_pointwise/Relu6","Const_41","Const_40"],"attr":{"data_format":{"s":"TkhXQw=="},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"strides":{"list":{"i":["1","2","2","1"]}},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"num_args":{"i":"1"},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="}}},
          {"name":"MobilenetV1/MobilenetV1/Conv2d_4_pointwise/Relu6","op":"_FusedConv2D","input":["MobilenetV1/MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm/add_1/conv","Const_39","Const_38"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"num_args":{"i":"1"},"data_format":{"s":"TkhXQw=="},"epsilon":{"f":0},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="}}},
          {"name":"MobilenetV1/MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm/add_1/conv","op":"FusedDepthwiseConv2dNative","input":["MobilenetV1/MobilenetV1/Conv2d_4_pointwise/Relu6","Const_37","Const_36"],"attr":{"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"num_args":{"i":"1"},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="}}},
          {"name":"MobilenetV1/MobilenetV1/Conv2d_5_pointwise/Relu6","op":"_FusedConv2D","input":["MobilenetV1/MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm/add_1/conv","Const_35","Const_34"],"device":"/device:CPU:0","attr":{"epsilon":{"f":0},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"num_args":{"i":"1"},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="}}},
          {"name":"MobilenetV1/MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm/add_1/conv","op":"FusedDepthwiseConv2dNative","input":["MobilenetV1/MobilenetV1/Conv2d_5_pointwise/Relu6","Const_33","Const_32"],"attr":{"num_args":{"i":"1"},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"strides":{"list":{"i":["1","2","2","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"MobilenetV1/MobilenetV1/Conv2d_6_pointwise/Relu6","op":"_FusedConv2D","input":["MobilenetV1/MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm/add_1/conv","Const_31","Const_30"],"device":"/device:CPU:0","attr":{"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"num_args":{"i":"1"},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"epsilon":{"f":0},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"padding":{"s":"U0FNRQ=="}}},
          {"name":"MobilenetV1/MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm/add_1/conv","op":"FusedDepthwiseConv2dNative","input":["MobilenetV1/MobilenetV1/Conv2d_6_pointwise/Relu6","Const_29","Const_28"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"explicit_paddings":{"list":{}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"dilations":{"list":{"i":["1","1","1","1"]}},"num_args":{"i":"1"}}},
          {"name":"MobilenetV1/MobilenetV1/Conv2d_7_pointwise/Relu6","op":"_FusedConv2D","input":["MobilenetV1/MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm/add_1/conv","Const_27","Const_26"],"device":"/device:CPU:0","attr":{"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"T":{"type":"DT_FLOAT"},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"strides":{"list":{"i":["1","1","1","1"]}},"epsilon":{"f":0},"num_args":{"i":"1"}}},
          {"name":"MobilenetV1/MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm/add_1/conv","op":"FusedDepthwiseConv2dNative","input":["MobilenetV1/MobilenetV1/Conv2d_7_pointwise/Relu6","Const_25","Const_24"],"attr":{"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"num_args":{"i":"1"},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="}}},
          {"name":"MobilenetV1/MobilenetV1/Conv2d_8_pointwise/Relu6","op":"_FusedConv2D","input":["MobilenetV1/MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm/add_1/conv","Const_23","Const_22"],"device":"/device:CPU:0","attr":{"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"epsilon":{"f":0},"use_cudnn_on_gpu":{"b":true},"num_args":{"i":"1"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"MobilenetV1/MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm/add_1/conv","op":"FusedDepthwiseConv2dNative","input":["MobilenetV1/MobilenetV1/Conv2d_8_pointwise/Relu6","Const_21","Const_20"],"attr":{"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"num_args":{"i":"1"}}},
          {"name":"MobilenetV1/MobilenetV1/Conv2d_9_pointwise/Relu6","op":"_FusedConv2D","input":["MobilenetV1/MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm/add_1/conv","Const_19","Const_18"],"device":"/device:CPU:0","attr":{"num_args":{"i":"1"},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"strides":{"list":{"i":["1","1","1","1"]}},"epsilon":{"f":0},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}}}},
          {"name":"MobilenetV1/MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm/add_1/conv","op":"FusedDepthwiseConv2dNative","input":["MobilenetV1/MobilenetV1/Conv2d_9_pointwise/Relu6","Const_17","Const_16"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"num_args":{"i":"1"},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}}}},
          {"name":"MobilenetV1/MobilenetV1/Conv2d_10_pointwise/Relu6","op":"_FusedConv2D","input":["MobilenetV1/MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm/add_1/conv","Const_15","Const_14"],"device":"/device:CPU:0","attr":{"strides":{"list":{"i":["1","1","1","1"]}},"num_args":{"i":"1"},"data_format":{"s":"TkhXQw=="},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"epsilon":{"f":0},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true}}},
          {"name":"MobilenetV1/MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm/add_1/conv","op":"FusedDepthwiseConv2dNative","input":["MobilenetV1/MobilenetV1/Conv2d_10_pointwise/Relu6","Const_13","Const_12"],"attr":{"num_args":{"i":"1"},"padding":{"s":"U0FNRQ=="},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}}}},
          {"name":"MobilenetV1/MobilenetV1/Conv2d_11_pointwise/Relu6","op":"_FusedConv2D","input":["MobilenetV1/MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm/add_1/conv","Const_11","Const_10"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_FLOAT"},"epsilon":{"f":0},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"num_args":{"i":"1"},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"MobilenetV1/MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm/add_1/conv","op":"FusedDepthwiseConv2dNative","input":["MobilenetV1/MobilenetV1/Conv2d_11_pointwise/Relu6","Const_9","Const_8"],"attr":{"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"num_args":{"i":"1"},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"MobilenetV1/MobilenetV1/Conv2d_12_pointwise/Relu6","op":"_FusedConv2D","input":["MobilenetV1/MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm/add_1/conv","Const_7","Const_6"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"strides":{"list":{"i":["1","1","1","1"]}},"epsilon":{"f":0},"num_args":{"i":"1"},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}}}},
          {"name":"MobilenetV1/MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm/add_1/conv","op":"FusedDepthwiseConv2dNative","input":["MobilenetV1/MobilenetV1/Conv2d_12_pointwise/Relu6","Const_5","Const_4"],"attr":{"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"num_args":{"i":"1"},"padding":{"s":"U0FNRQ=="}}},
          {"name":"MobilenetV1/MobilenetV1/Conv2d_13_pointwise/Relu6","op":"_FusedConv2D","input":["MobilenetV1/MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm/add_1/conv","Const_3","Const_2"],"device":"/device:CPU:0","attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"num_args":{"i":"1"},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"epsilon":{"f":0},"padding":{"s":"U0FNRQ=="},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}}}},
          {"name":"MobilenetV1/heatmap_2/BiasAdd","op":"_FusedConv2D","input":["MobilenetV1/MobilenetV1/Conv2d_13_pointwise/Relu6","Const_57","Const_56"],"device":"/device:CPU:0","attr":{"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"num_args":{"i":"1"},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"epsilon":{"f":0},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"MobilenetV1/displacement_fwd_2/BiasAdd","op":"_FusedConv2D","input":["MobilenetV1/MobilenetV1/Conv2d_13_pointwise/Relu6","Const_59","Const_58"],"device":"/device:CPU:0","attr":{"epsilon":{"f":0},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"num_args":{"i":"1"},"use_cudnn_on_gpu":{"b":true}}},
          {"name":"MobilenetV1/offset_2/BiasAdd","op":"_FusedConv2D","input":["MobilenetV1/MobilenetV1/Conv2d_13_pointwise/Relu6","Const_1","Const"],"device":"/device:CPU:0","attr":{"epsilon":{"f":0},"strides":{"list":{"i":["1","1","1","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"use_cudnn_on_gpu":{"b":true},"num_args":{"i":"1"},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"padding":{"s":"U0FNRQ=="}}},
          {"name":"MobilenetV1/displacement_bwd_2/BiasAdd","op":"_FusedConv2D","input":["MobilenetV1/MobilenetV1/Conv2d_13_pointwise/Relu6","Const_61","Const_60"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"epsilon":{"f":0},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"num_args":{"i":"1"}}}
      ],
      "library": {},
      "versions": {}
  },
  "weightsManifest":
  [
      {
          "paths": ["posenet.bin"],
          "weights": [{"name":"Const_61","shape":[1,1,384,32],"dtype":"float32"},{"name":"Const_60","shape":[32],"dtype":"float32"},{"name":"Const_59","shape":[1,1,384,32],"dtype":"float32"},{"name":"Const_58","shape":[32],"dtype":"float32"},{"name":"Const_57","shape":[1,1,384,17],"dtype":"float32"},{"name":"Const_56","shape":[17],"dtype":"float32"},{"name":"Const_55","shape":[3,3,3,24],"dtype":"float32"},{"name":"Const_54","shape":[24],"dtype":"float32"},{"name":"Const_53","shape":[3,3,24,1],"dtype":"float32"},{"name":"Const_52","shape":[24],"dtype":"float32"},{"name":"Const_51","shape":[1,1,24,48],"dtype":"float32"},{"name":"Const_50","shape":[48],"dtype":"float32"},{"name":"Const_49","shape":[3,3,48,1],"dtype":"float32"},{"name":"Const_48","shape":[48],"dtype":"float32"},{"name":"Const_47","shape":[1,1,48,96],"dtype":"float32"},{"name":"Const_46","shape":[96],"dtype":"float32"},{"name":"Const_45","shape":[3,3,96,1],"dtype":"float32"},{"name":"Const_44","shape":[96],"dtype":"float32"},{"name":"Const_43","shape":[1,1,96,96],"dtype":"float32"},{"name":"Const_42","shape":[96],"dtype":"float32"},{"name":"Const_41","shape":[3,3,96,1],"dtype":"float32"},{"name":"Const_40","shape":[96],"dtype":"float32"},{"name":"Const_39","shape":[1,1,96,192],"dtype":"float32"},{"name":"Const_38","shape":[192],"dtype":"float32"},{"name":"Const_37","shape":[3,3,192,1],"dtype":"float32"},{"name":"Const_36","shape":[192],"dtype":"float32"},{"name":"Const_35","shape":[1,1,192,192],"dtype":"float32"},{"name":"Const_34","shape":[192],"dtype":"float32"},{"name":"Const_33","shape":[3,3,192,1],"dtype":"float32"},{"name":"Const_32","shape":[192],"dtype":"float32"},{"name":"Const_31","shape":[1,1,192,384],"dtype":"float32"},{"name":"Const_30","shape":[384],"dtype":"float32"},{"name":"Const_29","shape":[3,3,384,1],"dtype":"float32"},{"name":"Const_28","shape":[384],"dtype":"float32"},{"name":"Const_27","shape":[1,1,384,384],"dtype":"float32"},{"name":"Const_26","shape":[384],"dtype":"float32"},{"name":"Const_25","shape":[3,3,384,1],"dtype":"float32"},{"name":"Const_24","shape":[384],"dtype":"float32"},{"name":"Const_23","shape":[1,1,384,384],"dtype":"float32"},{"name":"Const_22","shape":[384],"dtype":"float32"},{"name":"Const_21","shape":[3,3,384,1],"dtype":"float32"},{"name":"Const_20","shape":[384],"dtype":"float32"},{"name":"Const_19","shape":[1,1,384,384],"dtype":"float32"},{"name":"Const_18","shape":[384],"dtype":"float32"},{"name":"Const_17","shape":[3,3,384,1],"dtype":"float32"},{"name":"Const_16","shape":[384],"dtype":"float32"},{"name":"Const_15","shape":[1,1,384,384],"dtype":"float32"},{"name":"Const_14","shape":[384],"dtype":"float32"},{"name":"Const_13","shape":[3,3,384,1],"dtype":"float32"},{"name":"Const_12","shape":[384],"dtype":"float32"},{"name":"Const_11","shape":[1,1,384,384],"dtype":"float32"},{"name":"Const_10","shape":[384],"dtype":"float32"},{"name":"Const_9","shape":[3,3,384,1],"dtype":"float32"},{"name":"Const_8","shape":[384],"dtype":"float32"},{"name":"Const_7","shape":[1,1,384,384],"dtype":"float32"},{"name":"Const_6","shape":[384],"dtype":"float32"},{"name":"Const_5","shape":[3,3,384,1],"dtype":"float32"},{"name":"Const_4","shape":[384],"dtype":"float32"},{"name":"Const_3","shape":[1,1,384,384],"dtype":"float32"},{"name":"Const_2","shape":[384],"dtype":"float32"},{"name":"Const_1","shape":[1,1,384,34],"dtype":"float32"},{"name":"Const","shape":[34],"dtype":"float32"}]
      }
  ]
}