{
  "format": "graph-model",
  "generatedBy": "https://github.com/PINTO0309/PINTO_model_zoo/tree/main/109_Selfie_Segmentation",
  "convertedBy": "https://github.com/vladmandic",
  "signature":
  {
      "inputs":
      {
          "input_1:0": {"name":"input_1:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"256"},{"size":"256"},{"size":"3"}]}}
      },
      "outputs":
      {
          "activation_10:0": {"name":"activation_10:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"256"},{"size":"256"},{"size":"1"}]}}
      }
  },
  "modelTopology":
  {
      "node":
      [
          {"name":"segment/input_sizes","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"segment/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"2"},{"size":"2"},{"size":"1"},{"size":"16"}]}}}}},
          {"name":"Conv2D_41/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"16"},{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_40_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}}}},
          {"name":"Conv2D_42/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"16"},{"size":"16"}]}}}}},
          {"name":"conv2d_41_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}}}},
          {"name":"Conv2D_37/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"16"},{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_36_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_38/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"16"},{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_37_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}}}},
          {"name":"Conv2D_33/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_32_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_34/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_33_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_30/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_29_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"mul_21/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"mul_19/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_26/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"96"}]}}}}},
          {"name":"conv2d_25_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"add_9/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"depthwise_7/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"96"},{"size":"1"}]}}}}},
          {"name":"depthwise_conv2d_7/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"add_10/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_27/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"24"}]}}}}},
          {"name":"conv2d_26_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}}}},
          {"name":"Conv2D_28/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_27_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_29/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"32"}]}}}}},
          {"name":"conv2d_28_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"mul_17/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"mul_15/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"Conv2D_22/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_21_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"add_7/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"depthwise_6/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"96"},{"size":"1"}]}}}}},
          {"name":"depthwise_conv2d_6/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"add_8/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"Conv2D_23/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_22_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}}}},
          {"name":"Conv2D_24/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"96"}]}}}}},
          {"name":"conv2d_23_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_25/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"32"}]}}}}},
          {"name":"conv2d_24_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"mul_13/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"mul_11/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_18/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"128"}]}}}}},
          {"name":"conv2d_17_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},
          {"name":"add_5/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_5/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"128"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_conv2d_5/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},
          {"name":"add_6/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"Conv2D_19/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_18_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}}}},
          {"name":"Conv2D_20/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"128"}]}}}}},
          {"name":"conv2d_19_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_21/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"32"}]}}}}},
          {"name":"conv2d_20_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}}}},
          {"name":"mul_9/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"mul_7/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"Conv2D_14/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"128"}]}}}}},
          {"name":"conv2d_13_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"add_3/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_4/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"128"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_conv2d_4/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},
          {"name":"add_4/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"Conv2D_15/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"32"}]}}}}},
          {"name":"conv2d_14_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}}}},
          {"name":"Conv2D_16/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_15_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_17/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_16_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"mul_5/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"mul_3/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"conv2d_8_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}}}},
          {"name":"Conv2D_8/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"88"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_7_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"88"}]}}}}},
          {"name":"depthwise_2/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"88"},{"size":"1"}]}}}}},
          {"name":"depthwise_conv2d_2/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"88"}]}}}}},
          {"name":"Conv2D_9/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"88"},{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"mul_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"Conv2D/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"3"},{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"Conv2D_2/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"16"},{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_1_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}}}},
          {"name":"depthwise/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"16"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_conv2d/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}}}},
          {"name":"Conv2D_3/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"16"},{"size":"8"}]}}}}},
          {"name":"conv2d_2_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"8"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_4/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"8"},{"size":"16"}]}}}}},
          {"name":"conv2d_3_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}}}},
          {"name":"Conv2D_5/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"16"},{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_4_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}}}},
          {"name":"Conv2D_6/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"16"},{"size":"72"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_5_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"72"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_1/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"72"},{"size":"1"}]}}}}},
          {"name":"depthwise_conv2d_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"72"}]}}}}},
          {"name":"Conv2D_7/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"72"},{"size":"24"}]}}}}},
          {"name":"conv2d_6_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}}}},
          {"name":"Conv2D_10/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"96"}]}}}}},
          {"name":"conv2d_9_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"add_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"depthwise_3/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"96"},{"size":"1"}]}}}}},
          {"name":"depthwise_conv2d_3/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"add_2/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_11/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"24"}]}}}}},
          {"name":"conv2d_10_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_12/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"96"}]}}}}},
          {"name":"conv2d_11_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"Conv2D_13/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"32"}]}}}}},
          {"name":"conv2d_12_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}}}},
          {"name":"Conv2D_31/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"128"}]}}}}},
          {"name":"conv2d_30_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},
          {"name":"up_sampling2d_lambda/resize/size","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"Conv2D_32/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_31_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}}}},
          {"name":"Conv2D_35/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"24"}]}}}}},
          {"name":"conv2d_34_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}}}},
          {"name":"depthwise_8/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"24"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_conv2d_8/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"up_sampling2d_1_lambda/resize/size","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"Conv2D_36/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"16"}]}}}}},
          {"name":"conv2d_35_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}}}},
          {"name":"Conv2D_39/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"16"},{"size":"16"}]}}}}},
          {"name":"conv2d_38_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_9/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"16"},{"size":"1"}]}}}}},
          {"name":"depthwise_conv2d_9/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"up_sampling2d_2_lambda/resize/size","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"Conv2D_40/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"16"},{"size":"16"}]}}}}},
          {"name":"conv2d_39_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_43/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"16"},{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_42_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_10/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"16"},{"size":"1"}]}}}}},
          {"name":"depthwise_conv2d_10/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}}}},
          {"name":"segment_add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"input_1","op":"Placeholder","attr":{"dtype":{"type":"DT_FLOAT"},"shape":{"shape":{"dim":[{"size":"1"},{"size":"256"},{"size":"256"},{"size":"3"}]}}}},
          {"name":"Conv2D","op":"Conv2D","input":["input_1","Conv2D/filter"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"strides":{"list":{"i":["1","2","2","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true}}},
          {"name":"conv2d_1","op":"Add","input":["Conv2D","conv2d_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul","op":"Mul","input":["mul_1/y","conv2d_1"],"attr":{"T":{"type":"DT_FLOAT"},"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true}}},
          {"name":"add","op":"AddV2","input":["conv2d_1","add/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Relu6","op":"Relu6","input":["add"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_1","op":"Mul","input":["mul","Relu6"],"attr":{"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true},"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_2","op":"Conv2D","input":["mul_1","Conv2D_2/filter"],"device":"/device:CPU:0","attr":{"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="}}},
          {"name":"conv2d_1_1","op":"Add","input":["Conv2D_2","conv2d_1_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"re_lu","op":"Relu","input":["conv2d_1_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise","op":"DepthwiseConv2dNative","input":["re_lu","depthwise/filter_in"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","2","2","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}}}},
          {"name":"depthwise_conv2d","op":"Add","input":["depthwise","depthwise_conv2d/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"re_lu_1","op":"Relu","input":["depthwise_conv2d"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"average_pooling2d_avgpool/AvgPool","op":"AvgPool","input":["re_lu_1"],"attr":{"ksize":{"list":{"i":["1","64","64","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","64","64","1"]}},"padding":{"s":"VkFMSUQ="}}},
          {"name":"Conv2D_3","op":"Conv2D","input":["average_pooling2d_avgpool/AvgPool","Conv2D_3/filter"],"device":"/device:CPU:0","attr":{"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"VkFMSUQ="},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_2_1","op":"Add","input":["Conv2D_3","conv2d_2_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"re_lu_2","op":"Relu","input":["conv2d_2_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_4","op":"Conv2D","input":["re_lu_2","Conv2D_4/filter"],"device":"/device:CPU:0","attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"VkFMSUQ="},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_3_1","op":"Add","input":["Conv2D_4","conv2d_3_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation","op":"Sigmoid","input":["conv2d_3_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"multiply","op":"Mul","input":["re_lu_1","activation"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_5","op":"Conv2D","input":["multiply","Conv2D_5/filter"],"device":"/device:CPU:0","attr":{"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"use_cudnn_on_gpu":{"b":true}}},
          {"name":"conv2d_4_1","op":"Add","input":["Conv2D_5","conv2d_4_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_6","op":"Conv2D","input":["conv2d_4_1","Conv2D_6/filter"],"device":"/device:CPU:0","attr":{"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"conv2d_5_1","op":"Add","input":["Conv2D_6","conv2d_5_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"re_lu_3","op":"Relu","input":["conv2d_5_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_1","op":"DepthwiseConv2dNative","input":["re_lu_3","depthwise_1/filter_in"],"attr":{"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","2","2","1"]}},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},
          {"name":"depthwise_conv2d_1","op":"Add","input":["depthwise_1","depthwise_conv2d_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"re_lu_4","op":"Relu","input":["depthwise_conv2d_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_7","op":"Conv2D","input":["re_lu_4","Conv2D_7/filter"],"device":"/device:CPU:0","attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true}}},
          {"name":"conv2d_6_1","op":"Add","input":["Conv2D_7","conv2d_6_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_8","op":"Conv2D","input":["conv2d_6_1","Conv2D_8/filter"],"device":"/device:CPU:0","attr":{"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"conv2d_7_1","op":"Add","input":["Conv2D_8","conv2d_7_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"re_lu_5","op":"Relu","input":["conv2d_7_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_2","op":"DepthwiseConv2dNative","input":["re_lu_5","depthwise_2/filter_in"],"attr":{"padding":{"s":"U0FNRQ=="},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="}}},
          {"name":"depthwise_conv2d_2","op":"Add","input":["depthwise_2","depthwise_conv2d_2/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"re_lu_6","op":"Relu","input":["depthwise_conv2d_2"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_9","op":"Conv2D","input":["re_lu_6","Conv2D_9/filter"],"device":"/device:CPU:0","attr":{"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},
          {"name":"ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add__xeno_compat__1","op":"AddN","input":["Conv2D_9","conv2d_6_1"],"attr":{"T":{"type":"DT_FLOAT"},"_grappler_ArithmeticOptimizer_AddOpsRewriteStage":{"b":true},"N":{"i":"2"}}},
          {"name":"ArithmeticOptimizer/AddOpsRewrite_add__xeno_compat__1","op":"AddV2","input":["conv2d_8_1/y","ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add__xeno_compat__1"],"attr":{"T":{"type":"DT_FLOAT"},"_grappler_ArithmeticOptimizer_AddOpsRewriteStage":{"b":true}}},
          {"name":"Conv2D_10","op":"Conv2D","input":["ArithmeticOptimizer/AddOpsRewrite_add__xeno_compat__1","Conv2D_10/filter"],"device":"/device:CPU:0","attr":{"use_cudnn_on_gpu":{"b":true},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_9_1","op":"Add","input":["Conv2D_10","conv2d_9_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_2","op":"Mul","input":["mul_3/y","conv2d_9_1"],"attr":{"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true},"T":{"type":"DT_FLOAT"}}},
          {"name":"add_1","op":"AddV2","input":["conv2d_9_1","add_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Relu6_1","op":"Relu6","input":["add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_3","op":"Mul","input":["mul_2","Relu6_1"],"attr":{"T":{"type":"DT_FLOAT"},"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true}}},
          {"name":"depthwise_3","op":"DepthwiseConv2dNative","input":["mul_3","depthwise_3/filter_in"],"attr":{"strides":{"list":{"i":["1","2","2","1"]}},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},
          {"name":"depthwise_conv2d_3","op":"Add","input":["depthwise_3","depthwise_conv2d_3/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_4","op":"Mul","input":["mul_5/y","depthwise_conv2d_3"],"attr":{"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true},"T":{"type":"DT_FLOAT"}}},
          {"name":"add_2","op":"AddV2","input":["depthwise_conv2d_3","add_2/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Relu6_2","op":"Relu6","input":["add_2"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_5","op":"Mul","input":["mul_4","Relu6_2"],"attr":{"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true},"T":{"type":"DT_FLOAT"}}},
          {"name":"average_pooling2d_1_avgpool/AvgPool","op":"AvgPool","input":["mul_5"],"attr":{"padding":{"s":"VkFMSUQ="},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","16","16","1"]}},"ksize":{"list":{"i":["1","16","16","1"]}}}},
          {"name":"Conv2D_11","op":"Conv2D","input":["average_pooling2d_1_avgpool/AvgPool","Conv2D_11/filter"],"device":"/device:CPU:0","attr":{"explicit_paddings":{"list":{}},"padding":{"s":"VkFMSUQ="},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"conv2d_10_1","op":"Add","input":["Conv2D_11","conv2d_10_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"re_lu_7","op":"Relu","input":["conv2d_10_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_12","op":"Conv2D","input":["re_lu_7","Conv2D_12/filter"],"device":"/device:CPU:0","attr":{"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"VkFMSUQ="},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"conv2d_11_1","op":"Add","input":["Conv2D_12","conv2d_11_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_1","op":"Sigmoid","input":["conv2d_11_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"multiply_1","op":"Mul","input":["mul_5","activation_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_13","op":"Conv2D","input":["multiply_1","Conv2D_13/filter"],"device":"/device:CPU:0","attr":{"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"conv2d_12_1","op":"Add","input":["Conv2D_13","conv2d_12_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_14","op":"Conv2D","input":["conv2d_12_1","Conv2D_14/filter"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"conv2d_13_1","op":"Add","input":["Conv2D_14","conv2d_13_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_6","op":"Mul","input":["mul_7/y","conv2d_13_1"],"attr":{"T":{"type":"DT_FLOAT"},"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true}}},
          {"name":"add_3","op":"AddV2","input":["conv2d_13_1","add_3/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Relu6_3","op":"Relu6","input":["add_3"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_7","op":"Mul","input":["mul_6","Relu6_3"],"attr":{"T":{"type":"DT_FLOAT"},"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true}}},
          {"name":"depthwise_4","op":"DepthwiseConv2dNative","input":["mul_7","depthwise_4/filter_in"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}}}},
          {"name":"depthwise_conv2d_4","op":"Add","input":["depthwise_4","depthwise_conv2d_4/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_8","op":"Mul","input":["mul_9/y","depthwise_conv2d_4"],"attr":{"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true},"T":{"type":"DT_FLOAT"}}},
          {"name":"add_4","op":"AddV2","input":["depthwise_conv2d_4","add_4/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Relu6_4","op":"Relu6","input":["add_4"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_9","op":"Mul","input":["mul_8","Relu6_4"],"attr":{"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true},"T":{"type":"DT_FLOAT"}}},
          {"name":"average_pooling2d_2_avgpool/AvgPool","op":"AvgPool","input":["mul_9"],"attr":{"data_format":{"s":"TkhXQw=="},"padding":{"s":"VkFMSUQ="},"strides":{"list":{"i":["1","16","16","1"]}},"T":{"type":"DT_FLOAT"},"ksize":{"list":{"i":["1","16","16","1"]}}}},
          {"name":"Conv2D_15","op":"Conv2D","input":["average_pooling2d_2_avgpool/AvgPool","Conv2D_15/filter"],"device":"/device:CPU:0","attr":{"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"VkFMSUQ="},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_14_1","op":"Add","input":["Conv2D_15","conv2d_14_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"re_lu_8","op":"Relu","input":["conv2d_14_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_16","op":"Conv2D","input":["re_lu_8","Conv2D_16/filter"],"device":"/device:CPU:0","attr":{"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"padding":{"s":"VkFMSUQ="},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"conv2d_15_1","op":"Add","input":["Conv2D_16","conv2d_15_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_2","op":"Sigmoid","input":["conv2d_15_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"multiply_2","op":"Mul","input":["mul_9","activation_2"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_17","op":"Conv2D","input":["multiply_2","Conv2D_17/filter"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="}}},
          {"name":"conv2d_16_1","op":"Add","input":["Conv2D_17","conv2d_16_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"add_1__xeno_compat__1","op":"Add","input":["conv2d_16_1","conv2d_12_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_18","op":"Conv2D","input":["add_1__xeno_compat__1","Conv2D_18/filter"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"conv2d_17_1","op":"Add","input":["Conv2D_18","conv2d_17_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_10","op":"Mul","input":["mul_11/y","conv2d_17_1"],"attr":{"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true},"T":{"type":"DT_FLOAT"}}},
          {"name":"add_5","op":"AddV2","input":["conv2d_17_1","add_5/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Relu6_5","op":"Relu6","input":["add_5"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_11","op":"Mul","input":["mul_10","Relu6_5"],"attr":{"T":{"type":"DT_FLOAT"},"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true}}},
          {"name":"depthwise_5","op":"DepthwiseConv2dNative","input":["mul_11","depthwise_5/filter_in"],"attr":{"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_conv2d_5","op":"Add","input":["depthwise_5","depthwise_conv2d_5/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_12","op":"Mul","input":["mul_13/y","depthwise_conv2d_5"],"attr":{"T":{"type":"DT_FLOAT"},"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true}}},
          {"name":"add_6","op":"AddV2","input":["depthwise_conv2d_5","add_6/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Relu6_6","op":"Relu6","input":["add_6"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_13","op":"Mul","input":["mul_12","Relu6_6"],"attr":{"T":{"type":"DT_FLOAT"},"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true}}},
          {"name":"average_pooling2d_3_avgpool/AvgPool","op":"AvgPool","input":["mul_13"],"attr":{"ksize":{"list":{"i":["1","16","16","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","16","16","1"]}},"padding":{"s":"VkFMSUQ="}}},
          {"name":"Conv2D_19","op":"Conv2D","input":["average_pooling2d_3_avgpool/AvgPool","Conv2D_19/filter"],"device":"/device:CPU:0","attr":{"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"padding":{"s":"VkFMSUQ="},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"conv2d_18_1","op":"Add","input":["Conv2D_19","conv2d_18_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"re_lu_9","op":"Relu","input":["conv2d_18_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_20","op":"Conv2D","input":["re_lu_9","Conv2D_20/filter"],"device":"/device:CPU:0","attr":{"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"VkFMSUQ="},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"conv2d_19_1","op":"Add","input":["Conv2D_20","conv2d_19_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_3","op":"Sigmoid","input":["conv2d_19_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"multiply_3","op":"Mul","input":["mul_13","activation_3"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_21","op":"Conv2D","input":["multiply_3","Conv2D_21/filter"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_20_1","op":"Add","input":["Conv2D_21","conv2d_20_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"add_2__xeno_compat__1","op":"Add","input":["conv2d_20_1","add_1__xeno_compat__1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_22","op":"Conv2D","input":["add_2__xeno_compat__1","Conv2D_22/filter"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},
          {"name":"conv2d_21_1","op":"Add","input":["Conv2D_22","conv2d_21_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_14","op":"Mul","input":["mul_15/y","conv2d_21_1"],"attr":{"T":{"type":"DT_FLOAT"},"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true}}},
          {"name":"add_7","op":"AddV2","input":["conv2d_21_1","add_7/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Relu6_7","op":"Relu6","input":["add_7"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_15","op":"Mul","input":["mul_14","Relu6_7"],"attr":{"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true},"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_6","op":"DepthwiseConv2dNative","input":["mul_15","depthwise_6/filter_in"],"attr":{"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_conv2d_6","op":"Add","input":["depthwise_6","depthwise_conv2d_6/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_16","op":"Mul","input":["mul_17/y","depthwise_conv2d_6"],"attr":{"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true},"T":{"type":"DT_FLOAT"}}},
          {"name":"add_8","op":"AddV2","input":["depthwise_conv2d_6","add_8/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Relu6_8","op":"Relu6","input":["add_8"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_17","op":"Mul","input":["mul_16","Relu6_8"],"attr":{"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true},"T":{"type":"DT_FLOAT"}}},
          {"name":"average_pooling2d_4_avgpool/AvgPool","op":"AvgPool","input":["mul_17"],"attr":{"padding":{"s":"VkFMSUQ="},"strides":{"list":{"i":["1","16","16","1"]}},"ksize":{"list":{"i":["1","16","16","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},
          {"name":"Conv2D_23","op":"Conv2D","input":["average_pooling2d_4_avgpool/AvgPool","Conv2D_23/filter"],"device":"/device:CPU:0","attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"padding":{"s":"VkFMSUQ="},"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"use_cudnn_on_gpu":{"b":true}}},
          {"name":"conv2d_22_1","op":"Add","input":["Conv2D_23","conv2d_22_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"re_lu_10","op":"Relu","input":["conv2d_22_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_24","op":"Conv2D","input":["re_lu_10","Conv2D_24/filter"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"padding":{"s":"VkFMSUQ="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"conv2d_23_1","op":"Add","input":["Conv2D_24","conv2d_23_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"activation_4","op":"Sigmoid","input":["conv2d_23_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"multiply_4","op":"Mul","input":["mul_17","activation_4"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_25","op":"Conv2D","input":["multiply_4","Conv2D_25/filter"],"device":"/device:CPU:0","attr":{"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},
          {"name":"conv2d_24_1","op":"Add","input":["Conv2D_25","conv2d_24_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"add_3__xeno_compat__1","op":"Add","input":["conv2d_24_1","add_2__xeno_compat__1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_26","op":"Conv2D","input":["add_3__xeno_compat__1","Conv2D_26/filter"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="}}},
          {"name":"conv2d_25_1","op":"Add","input":["Conv2D_26","conv2d_25_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"mul_18","op":"Mul","input":["mul_19/y","conv2d_25_1"],"attr":{"_grappler_ArithmeticOptimizer_MinimizeBroadcasts":{"b":true},"T":{"type":"DT_FLOAT"}}},
          {"name":"add_9","op":"AddV2","input":["conv2d_25_1","add_9/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
